config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: jsravn
#+PROPERTY: header-args:emacs-lisp :tangle yes :cache yes :results silent :comments link
#+HTML_HEAD: <link rel='shortcut icon' type='image/png' href='https://www.gnu.org/software/emacs/favicon.png'>

* Intro
This is my foray into the world of literate Emacs configuration. I think I may have finally lost it. But let's give it a
shot!

I use [[https://github.com/hlissner/doom-emacs][doom-emacs]] as my core Emacs distribution. Doom loads its configuration from three files in =~/.config/doom=:
- init.el :: Doom modules to enable.
- config.el :: User configuration.
- packages.el :: Custom packages to load.

=config.org= is what generates all of these, and is what you are viewing. It lives in my [[https://github.com/jsravn/dotfiles/tree/master/private_dot_config/doom][dotfiles]].

* General configuration
** File variables
This configures the file variables for =config.el= and =init.el=. Apparently [[https://nullprogram.com/blog/2016/12/22/][enabling lexical binding]] makes them faster to
process.

#+BEGIN_SRC emacs-lisp
;;; ~/.config/doom/config.el -*- lexical-binding: t; -*-
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle "init.el"
;;; ~/.config/doom/init.el -*- lexical-binding: t; -*-
#+END_SRC

** Personal information
This contains various bits about myself that Emacs likes to use in various modules.

#+BEGIN_SRC emacs-lisp
(setq user-full-name "James Ravn"
      user-mail-address "james@r-vn.org"
      calendar-latitude 51.508166
      calendar-longitude -0.075971
      calendar-location-name "London, UK")
#+END_SRC

** Visual Settings
This tweaks the visuals to my liking.

*** Theme
Use the default doom-one theme, and the very nice [[https://www.fsd.it/shop/fonts/pragmatapro/][PragmataPro]] font.

#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-one
      doom-font (font-spec :family "PragmataPro Liga" :size 16)
      doom-variable-pitch-font (font-spec :family "sans" :size 14)
      doom-big-font (font-spec :family "PragmataPro Liga" :size 20)
      doom-unicode-font (font-spec :family "Noto Color Emoji" :size 16)
      +pretty-code-pragmata-pro-font-name "PragmataPro Liga")

#+END_SRC

*** Mixed pitch mode
Enable =mixed-pitch-mode= for some text modes. Also ensure it preserves the variable pitch height rather than inheriting from
the default face.

#+BEGIN_SRC emacs-lisp
(add-hook! (org-mode gfm-mode markdown-mode) #'mixed-pitch-mode)
(setq mixed-pitch-set-height t)
#+END_SRC

