config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-21 Thu 10:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jsravn" />
<link rel='shortcut icon' type='image/png' href='https://www.gnu.org/software/emacs/favicon.png'>
<!––tec/custom-head-start-->
<link rel='stylesheet' type='text/css' href='https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css'/>
<link rel='stylesheet' type='text/css' href='https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css'/>


<!––tec/custom-head-end-->
</head>
<body>
<div id="content">
<h1 class="title">Doom Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdc5b0c3">1. Intro</a></li>
<li><a href="#org2d4cc47">2. General configuration</a>
<ul>
<li><a href="#orgbe29503">2.1. File variables</a></li>
<li><a href="#org43a4dbd">2.2. Personal information</a></li>
<li><a href="#org9d4a0c7">2.3. Visual Settings</a>
<ul>
<li><a href="#orgaa05bdd">2.3.1. Theme</a></li>
<li><a href="#org42035cc">2.3.2. Mixed pitch mode</a></li>
<li><a href="#orgf90d3bb">2.3.3. Maximize</a></li>
</ul>
</li>
<li><a href="#org9265bc8">2.4. Editor behavior</a>
<ul>
<li><a href="#org9f3bd8c">2.4.1. Deletion</a></li>
<li><a href="#org5c05141">2.4.2. Auto-save</a></li>
<li><a href="#orga514ac9">2.4.3. Line wrapping</a></li>
<li><a href="#orge91f5b6">2.4.4. Window splitting</a></li>
<li><a href="#org57f2d8c">2.4.5. Clipboard and Copy/Paste</a></li>
<li><a href="#orgcee1878">2.4.6. Which-key</a></li>
</ul>
</li>
<li><a href="#org5d84416">2.5. Authinfo</a></li>
</ul>
</li>
<li><a href="#orgd58bd12">3. Packages</a>
<ul>
<li><a href="#org7af2475">3.1. Package loading</a>
<ul>
<li><a href="#org525f30b">3.1.1. atomic-chrome</a></li>
<li><a href="#org16a5f93">3.1.2. org-roam</a></li>
<li><a href="#org6f5afc7">3.1.3. lsp-mode</a></li>
<li><a href="#org58a576f">3.1.4. mu4e-alert</a></li>
<li><a href="#org5788801">3.1.5. org-msg</a></li>
<li><a href="#org474d4f5">3.1.6. org-alert</a></li>
<li><a href="#org62b93ee">3.1.7. caddyfile-mode</a></li>
</ul>
</li>
<li><a href="#orgd6713cc">3.2. Package configuration</a>
<ul>
<li><a href="#orge45bfb3">3.2.1. atomic-chrome configuration</a></li>
<li><a href="#orgd3e874c">3.2.2. caddyfile-mode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org20e41e3">4. Modules</a>
<ul>
<li><a href="#org73c02da">4.1. Enable modules (init.el)</a></li>
<li><a href="#orgd6f7bf4">4.2. Core configuration</a>
<ul>
<li><a href="#org69a9554">4.2.1. Projects</a></li>
<li><a href="#org917c18a">4.2.2. Smart parentheses</a></li>
</ul>
</li>
<li><a href="#orgfe01e23">4.3. UI configuration</a>
<ul>
<li><a href="#org45d2879">4.3.1. Workspaces</a></li>
<li><a href="#org70f7020">4.3.2. Zen</a></li>
<li><a href="#org62405ab">4.3.3. Treemacs</a></li>
</ul>
</li>
<li><a href="#orge1fc0e5">4.4. Completion</a></li>
<li><a href="#org1acd219">4.5. Checkers configuration</a>
<ul>
<li><a href="#orgff031ca">4.5.1. Flyspell</a></li>
</ul>
</li>
<li><a href="#orge4afd5a">4.6. Email configuration (mu4e)</a>
<ul>
<li>
<ul>
<li><a href="#org10ec2c7">4.6.0.1. Prerequisites</a></li>
<li><a href="#orge2aae54">4.6.0.2. Configuration</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga4a5fa2">4.7. Tools configuration</a>
<ul>
<li><a href="#orgef2881e">4.7.1. Language Server Protocol (LSP)</a></li>
<li><a href="#org9a916a0">4.7.2. Magit</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf2589cd">5. Languages</a>
<ul>
<li><a href="#org270a6f3">5.1. Golang</a></li>
<li><a href="#org37f7df9">5.2. Org Mode</a>
<ul>
<li><a href="#org5ce28c3">5.2.1. General settings</a>
<ul>
<li><a href="#org89a2d29">5.2.1.1. Editor</a></li>
<li><a href="#orge70e9cc">5.2.1.2. Visuals</a></li>
<li><a href="#orgec0a448">5.2.1.3. Archiving</a></li>
<li><a href="#orge7c1569">5.2.1.4. Download</a></li>
<li><a href="#org647861d">5.2.1.5. Exporting (General)</a></li>
<li><a href="#org8a60ed0">5.2.1.6. Exporting to HTML</a></li>
<li><a href="#org2ee9124">5.2.1.7. Exporting to Beamer</a></li>
<li><a href="#org7683973">5.2.1.8. Exporting to GFM</a></li>
</ul>
</li>
<li><a href="#org5d21efb">5.2.2. Task management</a>
<ul>
<li><a href="#orgd572363">5.2.2.1. Capture templates</a></li>
<li><a href="#org64f196f">5.2.2.2. Task settings</a></li>
<li><a href="#org6639a49">5.2.2.3. Contexts</a></li>
<li><a href="#org3fc3309">5.2.2.4. Refile targets</a></li>
<li><a href="#orgdb981a2">5.2.2.5. Habits</a></li>
<li><a href="#org883ce6c">5.2.2.6. Custom Agendas</a>
<ul>
<li><a href="#orgaa0e4bb">5.2.2.6.1. All Agenda Function</a></li>
<li><a href="#org2b3ebbc">5.2.2.6.2. Context Agenda Function</a></li>
<li><a href="#org655b4e7">5.2.2.6.3. Agenda Support Functions</a></li>
</ul>
</li>
<li><a href="#org4f2de42">5.2.2.7. Agenda Searches</a></li>
</ul>
</li>
<li><a href="#orgc26d067">5.2.3. Notes</a>
<ul>
<li><a href="#org65e90aa">5.2.3.1. org-roam</a></li>
<li><a href="#org78ed253">5.2.3.2. org-journal</a></li>
</ul>
</li>
<li><a href="#org12f5598">5.2.4. Calendar</a></li>
<li><a href="#org7c09906">5.2.5. Alerts</a></li>
</ul>
</li>
<li><a href="#org828802c">5.3. YAML</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdc5b0c3" class="outline-2">
<h2 id="orgdc5b0c3"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
This is my foray into the world of literate Emacs configuration. I think I may have finally lost it. But let&rsquo;s give it a
shot!
</p>

<p>
I use <a href="https://github.com/hlissner/doom-emacs">doom-emacs</a> as my core Emacs distribution. Doom loads its configuration from three files in <kbd>~/.config/doom</kbd>:
</p>
<dl class="org-dl">
<dt>init.el</dt><dd>Doom modules to enable.</dd>
<dt>config.el</dt><dd>User configuration.</dd>
<dt>packages.el</dt><dd>Custom packages to load.</dd>
</dl>

<p>
<kbd>config.org</kbd> is what generates all of these, and is what you are viewing. It lives in my <a href="https://github.com/jsravn/dotfiles/tree/master/private_dot_config/doom">dotfiles</a>.
</p>
</div>
</div>

<div id="outline-container-org2d4cc47" class="outline-2">
<h2 id="org2d4cc47"><span class="section-number-2">2</span> General configuration</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbe29503" class="outline-3">
<h3 id="orgbe29503"><span class="section-number-3">2.1</span> File variables</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This configures the file variables for <kbd>config.el</kbd> and <kbd>init.el</kbd>. Apparently <a href="https://nullprogram.com/blog/2016/12/22/">enabling lexical binding</a> makes them faster to
process.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;;; </span><span style="color: #5B6268;">~/.config/doom/config.el -*- lexical-binding: t; -*-</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;;; </span><span style="color: #5B6268;">~/.config/doom/init.el -*- lexical-binding: t; -*-</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org43a4dbd" class="outline-3">
<h3 id="org43a4dbd"><span class="section-number-3">2.2</span> Personal information</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This contains various bits about myself that Emacs likes to use in various modules.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">user-full-name</span> <span style="color: #98be65;">"James Ravn"</span>
      <span style="color: #dcaeea;">user-mail-address</span> <span style="color: #98be65;">"james@r-vn.org"</span>
      calendar-latitude <span style="color: #da8548; font-weight: bold;">51.508166</span>
      calendar-longitude <span style="color: #da8548; font-weight: bold;">-0.075971</span>
      calendar-location-name <span style="color: #98be65;">"London, UK"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d4a0c7" class="outline-3">
<h3 id="org9d4a0c7"><span class="section-number-3">2.3</span> Visual Settings</h3>
<div class="outline-text-3" id="text-2-3">
<p>
This tweaks the visuals to my liking.
</p>
</div>

<div id="outline-container-orgaa05bdd" class="outline-4">
<h4 id="orgaa05bdd"><span class="section-number-4">2.3.1</span> Theme</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Use the default doom-one theme, and the very nice <a href="https://www.fsd.it/shop/fonts/pragmatapro/">PragmataPro</a> font.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">doom-theme</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">doom-one</span>
      <span style="color: #dcaeea;">doom-font</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"PragmataPro Liga"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">16</span><span style="color: #c678dd;">)</span>
      <span style="color: #dcaeea;">doom-variable-pitch-font</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"sans"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">14</span><span style="color: #c678dd;">)</span>
      <span style="color: #dcaeea;">doom-big-font</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"PragmataPro Liga"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #c678dd;">)</span>
      <span style="color: #dcaeea;">doom-unicode-font</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">font-spec</span> <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"Noto Color Emoji"</span> <span style="color: #c678dd;">:size</span> <span style="color: #da8548; font-weight: bold;">16</span><span style="color: #c678dd;">)</span>
      <span style="color: #dcaeea;">+pretty-code-pragmata-pro-font-name</span> <span style="color: #98be65;">"PragmataPro Liga"</span><span style="color: #51afef;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org42035cc" class="outline-4">
<h4 id="org42035cc"><span class="section-number-4">2.3.2</span> Mixed pitch mode</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Enable <kbd>mixed-pitch-mode</kbd> for some text modes. Also ensure it preserves the variable pitch height rather than inheriting from
the default face.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">add-hook!</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">org-mode</span> gfm-mode markdown-mode<span style="color: #c678dd;">)</span> <span style="color: #51afef;">#'</span><span style="color: #dcaeea;">mixed-pitch-mode</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">mixed-pitch-set-height</span> t<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
