config.el
;; [[file:~/.config/doom/config.org::*File variables][File variables:1]]
;;; ~/.config/doom/config.el -*- lexical-binding: t; -*-
;; File variables:1 ends here

;; [[file:~/.config/doom/config.org::*Personal information][Personal information:1]]
(setq user-full-name "James Ravn"
      user-mail-address "james@r-vn.org"
      calendar-latitude 51.508166
      calendar-longitude -0.075971
      calendar-location-name "London, UK")
;; Personal information:1 ends here

;; [[file:~/.config/doom/config.org::*Theme][Theme:1]]
(setq doom-theme 'doom-one
      doom-font (font-spec :family "PragmataPro Liga" :size 16)
      doom-variable-pitch-font (font-spec :family "sans" :size 14)
      doom-big-font (font-spec :family "PragmataPro Liga" :size 20)
      doom-unicode-font (font-spec :family "Noto Color Emoji" :size 16)
      +pretty-code-pragmata-pro-font-name "PragmataPro Liga")
;; Theme:1 ends here

;; [[file:~/.config/doom/config.org::*Mixed pitch mode][Mixed pitch mode:1]]
(add-hook! (org-mode gfm-mode markdown-mode) #'mixed-pitch-mode)
(setq mixed-pitch-set-height t)
;; Mixed pitch mode:1 ends here
