config.org
*** Maximize
Maximize the frame when doom starts. I prefer it always opening up this way. Note this has no real effect if using a
tiling WM.

#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+END_SRC

** Editor behavior
This tweaks the general editor behavior to my liking.

*** Deletion
Delete files to the local Trash folder, e.g. =~/.local/share/Trash= on Linux.

#+BEGIN_SRC emacs-lisp
(setq delete-by-moving-to-trash t)
#+END_SRC

Make undo more fine-grained.

#+BEGIN_SRC emacs-lisp
(setq evil-want-fine-undo t)
#+END_SRC

*** Auto-save
I want Emacs to auto-save files I'm working on to avoid the tedium of manual saving all the time. Auto save can be
obnoxious if done incorrectly, so I want it to only save when safe.

First I use the built-in auto-save functionality to save the buffer after some idle time.

#+BEGIN_SRC emacs-lisp
(auto-save-visited-mode t)
#+END_SRC

And like other modern editors, I want Emacs to save the buffer when the focus changes. To avoid weird issues, such as
when interacting with popups, I only save when swapping between file buffers and when the frame loses focus.

#+BEGIN_SRC emacs-lisp
(add-hook! '(doom-switch-buffer-hook
             doom-switch-window-hook)
  (if (buffer-file-name) (save-some-buffers t))) ; avoid saving when switching to a non-file buffer
(add-function :after after-focus-change-function
              (lambda () (save-some-buffers t)))
#+END_SRC

*** Line wrapping
Fill column primarily affects how Emacs breaks lines in ~auto-fill-mode~. The default is 80. I set it to 120 which is a
bit nicer for modern screens. I also enable a fill column indicator for non-text modes (it looks bad in text modes due
to variable pitch fonts).

#+BEGIN_SRC emacs-lisp
(setq-default fill-column 120)
(add-hook! '(text-mode-hook prog-mode-hook conf-mode-hook)
           #'display-fill-column-indicator-mode)
#+END_SRC

Also I disable ~auto-fill-mode~ by default. I prefer to enable it only when needed, as it doesn't play nicely with many
of the text files I work on. Instead I use ~+word-wrap-mode~ which is equivalent to using =SPC t w= by default. _Disable
this for now as I've come to like auto-fill mode as the default._

#+BEGIN_SRC emacs-lisp
;; (remove-hook 'text-mode-hook #'auto-fill-mode)
;; (add-hook 'text-mode-hook #'+word-wrap-mode)
#+END_SRC

*** Window splitting
These changes makes window splitting a bit nicer.

First, I want focus to change to newly created windows.

#+BEGIN_SRC emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t)
#+END_SRC

Also, Emacs automatically splits windows if it thinks there is enough room. I find the default of 160 too aggressive, so
I increase it to make Emacs more conservative.

#+BEGIN_SRC emacs-lisp
(setq split-width-threshold 240)
#+END_SRC

*** Clipboard and Copy/Paste
I want to integrate Emacs with the system clipboard. All copy/paste goes into and takes from the system clipboard. This allows
easy copying in other applications and pasting into Emacs via =p= or similar.

#+BEGIN_SRC emacs-lisp
(setq select-enable-clipboard t)
#+END_SRC

And allow pasting from system clipboard with the typical Linux =C-S-v= while in insert mode:

#+BEGIN_SRC emacs-lisp
(map!
 :i "C-S-v" #'yank)
#+END_SRC
*** Which-key
Reduce the popup delay for =which-key=.

#+BEGIN_SRC emacs-lisp
(setq which-key-idle-delay 0.5)
#+END_SRC

** Authinfo
Sensitive credentials are stored in a gpg encrypted auth file. I prefer to only use =~/.authinfo.gpg=, rather than doom's default of =~/.emacs.d/.local/etc/authinfo.gpg= .

#+BEGIN_SRC emacs-lisp
(setq auth-sources '("~/.authinfo.gpg"))
#+END_SRC

