config.html

<div id="outline-container-orgf90d3bb" class="outline-4">
<h4 id="orgf90d3bb"><span class="section-number-4">2.3.3</span> Maximize</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Maximize the frame when doom starts. I prefer it always opening up this way. Note this has no real effect if using a
tiling WM.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">default-frame-alist</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>fullscreen . maximized<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9265bc8" class="outline-3">
<h3 id="org9265bc8"><span class="section-number-3">2.4</span> Editor behavior</h3>
<div class="outline-text-3" id="text-2-4">
<p>
This tweaks the general editor behavior to my liking.
</p>
</div>

<div id="outline-container-org9f3bd8c" class="outline-4">
<h4 id="org9f3bd8c"><span class="section-number-4">2.4.1</span> Deletion</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Delete files to the local Trash folder, e.g. <kbd>~/.local/share/Trash</kbd> on Linux.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">delete-by-moving-to-trash</span> t<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Make undo more fine-grained.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">evil-want-fine-undo</span> t<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c05141" class="outline-4">
<h4 id="org5c05141"><span class="section-number-4">2.4.2</span> Auto-save</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
I want Emacs to auto-save files I&rsquo;m working on to avoid the tedium of manual saving all the time. Auto save can be
obnoxious if done incorrectly, so I want it to only save when safe.
</p>

<p>
First I use the built-in auto-save functionality to save the buffer after some idle time.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #dcaeea;">auto-save-visited-mode</span> t<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And like other modern editors, I want Emacs to save the buffer when the focus changes. To avoid weird issues, such as
when interacting with popups, I only save when swapping between file buffers and when the frame loses focus.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">add-hook!</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #dcaeea;">doom-switch-buffer-hook</span>
             <span style="color: #dcaeea;">doom-switch-window-hook</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span><span style="color: #dcaeea;">buffer-file-name</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">save-some-buffers</span> t<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">avoid saving when switching to a non-file buffer</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">add-function</span> <span style="color: #c678dd;">:after</span> <span style="color: #dcaeea;">after-focus-change-function</span>
              <span style="color: #c678dd;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #98be65;">()</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">save-some-buffers</span> t<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga514ac9" class="outline-4">
<h4 id="orga514ac9"><span class="section-number-4">2.4.3</span> Line wrapping</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Fill column primarily affects how Emacs breaks lines in <code>auto-fill-mode</code>. The default is 80. I set it to 120 which is a
bit nicer for modern screens. I also enable a fill column indicator for non-text modes (it looks bad in text modes due
to variable pitch fonts).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq-default</span> <span style="color: #dcaeea;">fill-column</span> <span style="color: #da8548; font-weight: bold;">120</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">add-hook!</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #dcaeea;">text-mode-hook</span> <span style="color: #dcaeea;">prog-mode-hook</span> conf-mode-hook<span style="color: #c678dd;">)</span>
           <span style="color: #51afef;">#'</span><span style="color: #dcaeea;">display-fill-column-indicator-mode</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Also I disable <code>auto-fill-mode</code> by default. I prefer to enable it only when needed, as it doesn&rsquo;t play nicely with many
of the text files I work on. Instead I use <code>+word-wrap-mode</code> which is equivalent to using <kbd>SPC t w</kbd> by default. <span class="underline">Disable
this for now as I&rsquo;ve come to like auto-fill mode as the default.</span>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(remove-hook 'text-mode-hook #'auto-fill-mode)</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(add-hook 'text-mode-hook #'+word-wrap-mode)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge91f5b6" class="outline-4">
<h4 id="orge91f5b6"><span class="section-number-4">2.4.4</span> Window splitting</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
These changes makes window splitting a bit nicer.
</p>

<p>
First, I want focus to change to newly created windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">evil-vsplit-window-right</span> t
      <span style="color: #dcaeea;">evil-split-window-below</span> t<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Also, Emacs automatically splits windows if it thinks there is enough room. I find the default of 160 too aggressive, so
I increase it to make Emacs more conservative.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">split-width-threshold</span> <span style="color: #da8548; font-weight: bold;">240</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org57f2d8c" class="outline-4">
<h4 id="org57f2d8c"><span class="section-number-4">2.4.5</span> Clipboard and Copy/Paste</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
I want to integrate Emacs with the system clipboard. All copy/paste goes into and takes from the system clipboard. This allows
easy copying in other applications and pasting into Emacs via <kbd>p</kbd> or similar.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">select-enable-clipboard</span> t<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And allow pasting from system clipboard with the typical Linux <kbd>C-S-v</kbd> while in insert mode:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span>
 <span style="color: #c678dd;">:i</span> <span style="color: #98be65;">"C-S-v"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">yank</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcee1878" class="outline-4">
<h4 id="orgcee1878"><span class="section-number-4">2.4.6</span> Which-key</h4>
<div class="outline-text-4" id="text-2-4-6">
<p>
Reduce the popup delay for <kbd>which-key</kbd>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">which-key-idle-delay</span> <span style="color: #da8548; font-weight: bold;">0.5</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5d84416" class="outline-3">
<h3 id="org5d84416"><span class="section-number-3">2.5</span> Authinfo</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Sensitive credentials are stored in a gpg encrypted auth file. I prefer to only use <kbd>~/.authinfo.gpg</kbd>, rather than doom&rsquo;s default of <kbd>~/.emacs.d/.local/etc/authinfo.gpg</kbd> .
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">auth-sources</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"~/.authinfo.gpg"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
