config.el

;; [[file:~/.config/doom/config.org::*Maximize][Maximize:1]]
(add-to-list 'default-frame-alist '(fullscreen . maximized))
;; Maximize:1 ends here

;; [[file:~/.config/doom/config.org::*Deletion][Deletion:1]]
(setq delete-by-moving-to-trash t)
;; Deletion:1 ends here

;; [[file:~/.config/doom/config.org::*Deletion][Deletion:2]]
(setq evil-want-fine-undo t)
;; Deletion:2 ends here

;; [[file:~/.config/doom/config.org::*Auto-save][Auto-save:1]]
(auto-save-visited-mode t)
;; Auto-save:1 ends here

;; [[file:~/.config/doom/config.org::*Auto-save][Auto-save:2]]
(add-hook! '(doom-switch-buffer-hook
             doom-switch-window-hook)
  (if (buffer-file-name) (save-some-buffers t))) ; avoid saving when switching to a non-file buffer
(add-function :after after-focus-change-function
              (lambda () (save-some-buffers t)))
;; Auto-save:2 ends here

;; [[file:~/.config/doom/config.org::*Line wrapping][Line wrapping:1]]
(setq-default fill-column 120)
(add-hook! '(text-mode-hook prog-mode-hook conf-mode-hook)
           #'display-fill-column-indicator-mode)
;; Line wrapping:1 ends here

;; [[file:~/.config/doom/config.org::*Line wrapping][Line wrapping:2]]
;; (remove-hook 'text-mode-hook #'auto-fill-mode)
;; (add-hook 'text-mode-hook #'+word-wrap-mode)
;; Line wrapping:2 ends here

;; [[file:~/.config/doom/config.org::*Window splitting][Window splitting:1]]
(setq evil-vsplit-window-right t
      evil-split-window-below t)
;; Window splitting:1 ends here

;; [[file:~/.config/doom/config.org::*Window splitting][Window splitting:2]]
(setq split-width-threshold 240)
;; Window splitting:2 ends here

;; [[file:~/.config/doom/config.org::*Clipboard and Copy/Paste][Clipboard and Copy/Paste:1]]
(setq select-enable-clipboard t)
;; Clipboard and Copy/Paste:1 ends here

;; [[file:~/.config/doom/config.org::*Clipboard and Copy/Paste][Clipboard and Copy/Paste:2]]
(map!
 :i "C-S-v" #'yank)
;; Clipboard and Copy/Paste:2 ends here

;; [[file:~/.config/doom/config.org::*Which-key][Which-key:1]]
(setq which-key-idle-delay 0.5)
;; Which-key:1 ends here

;; [[file:~/.config/doom/config.org::*Authinfo][Authinfo:1]]
(setq auth-sources '("~/.authinfo.gpg"))
;; Authinfo:1 ends here
