config.org
* Packages
This section defines the custom packages for =packages.el=.

=packages.el= should not be byte-compiled.

#+BEGIN_SRC emacs-lisp :tangle "packages.el"
;; -*- no-byte-compile: t; -*-
#+END_SRC

** Package loading
:PROPERTIES:
:header-args:emacs-lisp: :tangle "packages.el" :comments link
:END:

Use the ~package!~ macro for each package. Afterwards run ~doom refresh~ on the command line. Everything in this section
goes into =packges.el=.

*** atomic-chrome
=atomic-chrome= provides integration with [[https://atom.io/packages/atomic-chrome][atomic chrome]] extension. This lets me use Emacs to edit browser text
boxes! It's very handy for large Github comments.

#+BEGIN_SRC emacs-lisp :tangle "packages.el"
(package! atomic-chrome)
#+END_SRC

*** org-roam
=org-roam= is included by default in doom. I like to use the latest version - so I pin it to a more recent one.

#+BEGIN_SRC emacs-lisp :tangle "packages.el"
(package! org-roam :pin "4af4d2e4d5f18422fe0f90d5d83fe4c10ef1a20f")
#+END_SRC

*** lsp-mode

Use the latest LSP.

#+BEGIN_SRC emacs-lisp :tangle "packages.el"
(unpin! lsp-mode)
#+END_SRC

*** mu4e-alert

Mail notifications. Used for ~doom-modeline-m4ue~.

#+BEGIN_SRC emacs-lisp :tangle "packages.el"
(package! mu4e-alert)
#+END_SRC

*** org-msg

Send HTML mail with org-mode. Better than the buggy/unsupported =org-mu4e-compose-mode=.

#+BEGIN_SRC emacs-lisp :tangle "packages.el"
(package! org-msg)
#+END_SRC

*** org-alert
Used to generate system notifications from org agendas.

#+BEGIN_SRC emacs-lisp :tangle "packages.el"
(package! org-alert)
#+END_SRC

***  caddyfile-mode

https://github.com/Schnouki/caddyfile-mode

#+BEGIN_SRC emacs-lisp :tangle "packages.el"
(package! caddyfile-mode)
#+END_SRC

** Package configuration
For configuring packages that are loaded in =packages.el=.

*** atomic-chrome configuration
Enable [[*atomic-chrome][atomic-chrome]] integration.

#+BEGIN_SRC emacs-lisp
(use-package! atomic-chrome
  :after-call focus-out-hook
  :config
  (setq atomic-chrome-default-major-mode 'markdown-mode
        atomic-chrome-buffer-open-style 'frame)
  (atomic-chrome-start-server))
#+END_SRC
*** caddyfile-mode

#+BEGIN_SRC emacs-lisp
(use-package caddyfile-mode
  :mode (("Caddyfile\\'" . caddyfile-mode)
         ("Corefile\\'" . caddyfile-mode)
         ("caddy\\.conf\\'" . caddyfile-mode)))
#+END_SRC

* Modules
This section configures the doom modules. Languages have their own [[*Languages][dedicated section]].

