config.html

<div id="outline-container-orgd58bd12" class="outline-2">
<h2 id="orgd58bd12"><span class="section-number-2">3</span> Packages</h2>
<div class="outline-text-2" id="text-3">
<p>
This section defines the custom packages for <kbd>packages.el</kbd>.
</p>

<p>
<kbd>packages.el</kbd> should not be byte-compiled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">-*- no-byte-compile: t; -*-</span>
</pre>
</div>
</div>

<div id="outline-container-org7af2475" class="outline-3">
<h3 id="org7af2475"><span class="section-number-3">3.1</span> Package loading</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Use the <code>package!</code> macro for each package. Afterwards run <code>doom refresh</code> on the command line. Everything in this section
goes into <kbd>packges.el</kbd>.
</p>
</div>

<div id="outline-container-org525f30b" class="outline-4">
<h4 id="org525f30b"><span class="section-number-4">3.1.1</span> atomic-chrome</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<kbd>atomic-chrome</kbd> provides integration with <a href="https://atom.io/packages/atomic-chrome">atomic chrome</a> extension. This lets me use Emacs to edit browser text
boxes! It&rsquo;s very handy for large Github comments.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">package!</span> atomic-chrome<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org16a5f93" class="outline-4">
<h4 id="org16a5f93"><span class="section-number-4">3.1.2</span> org-roam</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<kbd>org-roam</kbd> is included by default in doom. I like to use the latest version - so I pin it to a more recent one.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">package!</span> org-roam <span style="color: #c678dd;">:pin</span> <span style="color: #98be65;">"4af4d2e4d5..."</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f5afc7" class="outline-4">
<h4 id="org6f5afc7"><span class="section-number-4">3.1.3</span> lsp-mode</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Use the latest LSP.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">unpin!</span> <span style="color: #dcaeea;">lsp-mode</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org58a576f" class="outline-4">
<h4 id="org58a576f"><span class="section-number-4">3.1.4</span> mu4e-alert</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Mail notifications. Used for <code>doom-modeline-m4ue</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">package!</span> mu4e-alert<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5788801" class="outline-4">
<h4 id="org5788801"><span class="section-number-4">3.1.5</span> org-msg</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
Send HTML mail with org-mode. Better than the buggy/unsupported <kbd>org-mu4e-compose-mode</kbd>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">package!</span> org-msg<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org474d4f5" class="outline-4">
<h4 id="org474d4f5"><span class="section-number-4">3.1.6</span> org-alert</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
Used to generate system notifications from org agendas.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">package!</span> org-alert<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org62b93ee" class="outline-4">
<h4 id="org62b93ee"><span class="section-number-4">3.1.7</span> caddyfile-mode</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
<a href="https://github.com/Schnouki/caddyfile-mode">https://github.com/Schnouki/caddyfile-mode</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">package!</span> caddyfile-mode<span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd6713cc" class="outline-3">
<h3 id="orgd6713cc"><span class="section-number-3">3.2</span> Package configuration</h3>
<div class="outline-text-3" id="text-3-2">
<p>
For configuring packages that are loaded in <kbd>packages.el</kbd>.
</p>
</div>

<div id="outline-container-orge45bfb3" class="outline-4">
<h4 id="orge45bfb3"><span class="section-number-4">3.2.1</span> atomic-chrome configuration</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Enable <a href="#org525f30b">atomic-chrome</a> integration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package!</span> atomic-chrome
  <span style="color: #c678dd;">:after-call</span> <span style="color: #dcaeea;">focus-out-hook</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">atomic-chrome-default-major-mode</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">markdown-mode</span>
        <span style="color: #dcaeea;">atomic-chrome-buffer-open-style</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">frame</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">atomic-chrome-start-server</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd3e874c" class="outline-4">
<h4 id="orgd3e874c"><span class="section-number-4">3.2.2</span> caddyfile-mode</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">use-package</span> caddyfile-mode
  <span style="color: #c678dd;">:mode</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"Caddyfile\\'"</span> . caddyfile-mode<span style="color: #98be65;">)</span>
         <span style="color: #98be65;">(</span><span style="color: #98be65;">"Corefile\\'"</span> . caddyfile-mode<span style="color: #98be65;">)</span>
         <span style="color: #98be65;">(</span><span style="color: #98be65;">"caddy\\.conf\\'"</span> . caddyfile-mode<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org20e41e3" class="outline-2">
<h2 id="org20e41e3"><span class="section-number-2">4</span> Modules</h2>
<div class="outline-text-2" id="text-4">
<p>
This section configures the doom modules. Languages have their own <a href="#orgf2589cd">dedicated section</a>.
</p>
</div>
