config.el

;; [[file:~/.config/doom/config.org::*atomic-chrome configuration][atomic-chrome configuration:1]]
(use-package! atomic-chrome
  :after-call focus-out-hook
  :config
  (setq atomic-chrome-default-major-mode 'markdown-mode
        atomic-chrome-buffer-open-style 'frame)
  (atomic-chrome-start-server))
;; atomic-chrome configuration:1 ends here

;; [[file:~/.config/doom/config.org::*caddyfile-mode][caddyfile-mode:1]]
(use-package caddyfile-mode
  :mode (("Caddyfile\\'" . caddyfile-mode)
         ("Corefile\\'" . caddyfile-mode)
         ("caddy\\.conf\\'" . caddyfile-mode)))
;; caddyfile-mode:1 ends here
