config.org
** Enable modules (init.el)

This section generates =init.el= and is where I enable the doom modules I want. See [[https://github.com/hlissner/doom-emacs/blob/develop/init.example.el][init.example.el]] for all possible
options.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
(doom!
       :completion
       (company
        +childframe)
       (ivy
        +fuzzy
        +icons)

       :ui
       deft
       doom
       doom-dashboard
       hl-todo
       indent-guides
       (modeline)
       nav-flash
       ophints
       (popup
        +all
        +defaults)
       (pretty-code
        +pragmata-pro)
       treemacs
       vc-gutter
       vi-tilde-fringe
       window-select
       workspaces
       zen

       :editor
       (evil +everywhere)
       fold
       format
       multiple-cursors
       rotate-text
       snippets
       word-wrap

       :emacs
       dired
       electric
       vc

       :term
       vterm

       :checkers
       syntax
       spell

       :tools
       ansible
       docker
       (debugger +lsp)
       direnv
       editorconfig
       (eval
        +overlay)
       (lookup
        +docsets
        +dictionary)
       (lsp +peek)
       (magit +forge)
       make
       terraform

       :lang
       (clojure
        +cider
        +lsp)
       common-lisp
       data
       emacs-lisp
       (go +lsp)
       (java +lsp)
       javascript
       markdown
       nix
       (org
        +dragndrop
        +journal
        +roam)
       (python
        +lsp +pyenv)
       (scala +lsp)
       sh
       scheme
       (yaml +lsp)

       :email
       mu4e

       :config
       literate
       (default +bindings +smartparens))
#+END_SRC

** Core configuration
*** Projects
Set the search directories for projectile to auto-discovery projects.

#+BEGIN_SRC emacs-lisp
(setq projectile-project-search-path '("~/devel/" "~/sky" "~/gatech"))
#+END_SRC

Clear the projectile cache when swapping branches in =magit= which will likely change the files in the project.

#+BEGIN_SRC emacs-lisp
(defun +private/projectile-invalidate-cache (&rest _args)
  (projectile-invalidate-cache nil))
(advice-add 'magit-checkout
            :after #'+private/projectile-invalidate-cache)
(advice-add 'magit-branch-and-checkout
            :after #'+private/projectile-invalidate-cache)
#+END_SRC

***  Smart parentheses

Add convenient global binding for jumping outside of parenthesis. This replaces the default binding of ~upcase-word~,
which I have never used.

#+BEGIN_SRC emacs-lisp
(map!
 :ni "M-u"   #'sp-up-sexp)
#+END_SRC

** UI configuration
*** Workspaces
By default doom loads a project into the main workspace if it's empty. I don't like this behavior - I prefer to reserve
the main workspace for ad hoc editing of files. So always open up a new workspace when opening up a project.

#+BEGIN_SRC emacs-lisp
(setq +workspaces-on-switch-project-behavior t)
#+END_SRC

Add =SPC TAB ,= to switch to the last workspace, similar to switching to the last buffer.

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix-map ("TAB" . "workspace")
        :desc "Switch to last workspace"  ","   #'+workspace/other
       ))

#+END_SRC

*** Zen
Get rid of the change in font. I use zen mode for code, so I want to keep my normal font. Also enable the mode-line, and
set a width more appropriate for a modern screen size.

#+BEGIN_SRC emacs-lisp
(after! writeroom-mode
  (setq +zen-text-scale 0
        +zen-mixed-pitch-modes nil
        writeroom-mode-line t
        writeroom-width 160))
#+END_SRC

