config.html

<div id="outline-container-org73c02da" class="outline-3">
<h3 id="org73c02da"><span class="section-number-3">4.1</span> Enable modules (init.el)</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This section generates <kbd>init.el</kbd> and is where I enable the doom modules I want. See <a href="https://github.com/hlissner/doom-emacs/blob/develop/init.example.el">init.example.el</a> for all possible
options.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">doom!</span>
       <span style="color: #c678dd;">:completion</span>
       <span style="color: #c678dd;">(</span>company
        +childframe<span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span>ivy
        +fuzzy
        +icons<span style="color: #c678dd;">)</span>

       <span style="color: #c678dd;">:ui</span>
       deft
       doom
       doom-dashboard
       hl-todo
       indent-guides
       <span style="color: #c678dd;">(</span>modeline<span style="color: #c678dd;">)</span>
       nav-flash
       ophints
       <span style="color: #c678dd;">(</span>popup
        +all
        +defaults<span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span>pretty-code
        +pragmata-pro<span style="color: #c678dd;">)</span>
       treemacs
       vc-gutter
       vi-tilde-fringe
       window-select
       workspaces
       zen

       <span style="color: #c678dd;">:editor</span>
       <span style="color: #c678dd;">(</span>evil +everywhere<span style="color: #c678dd;">)</span>
       fold
       format
       multiple-cursors
       rotate-text
       snippets
       <span style="color: #dcaeea;">word-wrap</span>

       <span style="color: #c678dd;">:emacs</span>
       dired
       electric
       vc

       <span style="color: #c678dd;">:term</span>
       vterm

       <span style="color: #c678dd;">:checkers</span>
       syntax
       spell

       <span style="color: #c678dd;">:tools</span>
       ansible
       docker
       <span style="color: #c678dd;">(</span><span style="color: #dcaeea;">debugger</span> +lsp<span style="color: #c678dd;">)</span>
       direnv
       editorconfig
       <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">eval</span>
        +overlay<span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span>lookup
        +docsets
        +dictionary<span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span><span style="color: #c678dd;">lsp</span> +peek<span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span><span style="color: #c678dd;">magit</span> +forge<span style="color: #c678dd;">)</span>
       make
       terraform

       <span style="color: #c678dd;">:lang</span>
       <span style="color: #c678dd;">(</span>clojure
        +cider
        +lsp<span style="color: #c678dd;">)</span>
       common-lisp
       data
       emacs-lisp
       <span style="color: #c678dd;">(</span>go +lsp<span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span>java +lsp<span style="color: #c678dd;">)</span>
       javascript
       markdown
       nix
       <span style="color: #c678dd;">(</span>org
        +dragndrop
        +journal
        +roam<span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span>python
        +lsp +pyenv<span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span>scala +lsp<span style="color: #c678dd;">)</span>
       sh
       scheme
       <span style="color: #c678dd;">(</span>yaml +lsp<span style="color: #c678dd;">)</span>

       <span style="color: #c678dd;">:email</span>
       mu4e

       <span style="color: #c678dd;">:config</span>
       literate
       <span style="color: #c678dd;">(</span>default +bindings +smartparens<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6f7bf4" class="outline-3">
<h3 id="orgd6f7bf4"><span class="section-number-3">4.2</span> Core configuration</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org69a9554" class="outline-4">
<h4 id="org69a9554"><span class="section-number-4">4.2.1</span> Projects</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Set the search directories for projectile to auto-discovery projects.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">projectile-project-search-path</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"~/devel/"</span> <span style="color: #98be65;">"~/sky"</span> <span style="color: #98be65;">"~/gatech"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Clear the projectile cache when swapping branches in <kbd>magit</kbd> which will likely change the files in the project.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">+private/projectile-invalidate-cache</span> <span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">&amp;rest</span> _args<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">projectile-invalidate-cache</span> nil<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">advice-add</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">magit-checkout</span>
            <span style="color: #c678dd;">:after</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">+private/projectile-invalidate-cache</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">advice-add</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">magit-branch-and-checkout</span>
            <span style="color: #c678dd;">:after</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">+private/projectile-invalidate-cache</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org917c18a" class="outline-4">
<h4 id="org917c18a"><span class="section-number-4">4.2.2</span> Smart parentheses</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Add convenient global binding for jumping outside of parenthesis. This replaces the default binding of <code>upcase-word</code>,
which I have never used.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span>
 <span style="color: #c678dd;">:ni</span> <span style="color: #98be65;">"M-u"</span>   <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">sp-up-sexp</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfe01e23" class="outline-3">
<h3 id="orgfe01e23"><span class="section-number-3">4.3</span> UI configuration</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org45d2879" class="outline-4">
<h4 id="org45d2879"><span class="section-number-4">4.3.1</span> Workspaces</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
By default doom loads a project into the main workspace if it&rsquo;s empty. I don&rsquo;t like this behavior - I prefer to reserve
the main workspace for ad hoc editing of files. So always open up a new workspace when opening up a project.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">+workspaces-on-switch-project-behavior</span> t<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Add <kbd>SPC TAB ,</kbd> to switch to the last workspace, similar to switching to the last buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:leader</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix-map</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"TAB"</span> . <span style="color: #98be65;">"workspace"</span><span style="color: #98be65;">)</span>
        <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"Switch to last workspace"</span>  <span style="color: #98be65;">","</span>   <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">+workspace/other</span>
       <span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org70f7020" class="outline-4">
<h4 id="org70f7020"><span class="section-number-4">4.3.2</span> Zen</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Get rid of the change in font. I use zen mode for code, so I want to keep my normal font. Also enable the mode-line, and
set a width more appropriate for a modern screen size.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> writeroom-mode
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">+zen-text-scale</span> <span style="color: #da8548; font-weight: bold;">0</span>
        <span style="color: #dcaeea;">+zen-mixed-pitch-modes</span> nil
        writeroom-mode-line t
        writeroom-width <span style="color: #da8548; font-weight: bold;">160</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
