config.el

;; [[file:~/.config/doom/config.org::*Projects][Projects:1]]
(setq projectile-project-search-path '("~/devel/" "~/sky" "~/gatech"))
;; Projects:1 ends here

;; [[file:~/.config/doom/config.org::*Projects][Projects:2]]
(defun +private/projectile-invalidate-cache (&rest _args)
  (projectile-invalidate-cache nil))
(advice-add 'magit-checkout
            :after #'+private/projectile-invalidate-cache)
(advice-add 'magit-branch-and-checkout
            :after #'+private/projectile-invalidate-cache)
;; Projects:2 ends here

;; [[file:~/.config/doom/config.org::*Smart parentheses][Smart parentheses:1]]
(map!
 :ni "M-u"   #'sp-up-sexp)
;; Smart parentheses:1 ends here

;; [[file:~/.config/doom/config.org::*Workspaces][Workspaces:1]]
(setq +workspaces-on-switch-project-behavior t)
;; Workspaces:1 ends here

;; [[file:~/.config/doom/config.org::*Workspaces][Workspaces:2]]
(map! :leader
      (:prefix-map ("TAB" . "workspace")
        :desc "Switch to last workspace"  ","   #'+workspace/other
       ))
;; Workspaces:2 ends here

;; [[file:~/.config/doom/config.org::*Zen][Zen:1]]
(after! writeroom-mode
  (setq +zen-text-scale 0
        +zen-mixed-pitch-modes nil
        writeroom-mode-line t
        writeroom-width 160))
;; Zen:1 ends here

;; [[file:~/.config/doom/config.org::*Treemacs][Treemacs:1]]
(after! treemacs
