config.org
*** Treemacs
Enable follow-mode so the treemacs cursor follows the buffer file. Also increase the default width to show more stuff.

#+BEGIN_SRC emacs-lisp
(after! treemacs
  (treemacs-follow-mode 1)
  (setq treemacs-width 40))
#+END_SRC
** Completion
Fix company causing minibuffer region to disappear (e.g. lsp ask root dialogue).

#+BEGIN_SRC emacs-lisp
(after! company
  (remove-hook 'evil-normal-state-entry-hook #'company-abort))
#+END_SRC
** Checkers configuration
*** Flyspell
Flyspell can create a lot of lag in large buffers. Make it as lazy as possible.

#+BEGIN_SRC emacs-lisp
(after! flyspell (flyspell-lazy-mode 1))
#+END_SRC

** Email configuration (mu4e)
I am experimenting with =mu4e= for my email configuration. I'm using it with mbsync as the backend for syncing emails. Note as of 1.4, the root maildir is set via the ~mu init~ command so it is unnecessary to set it.

**** Prerequisites
First run mbsync for the first time to download all mail. Then set up =mu=:

#+BEGIN_SRC sh :tangle no
touch ~/Mail/r-vn.org/Spam/.noindex
mu init --maildir ~/Mail --my-address james@r-vn.org
#+END_SRC

