config.html

<div id="outline-container-org62405ab" class="outline-4">
<h4 id="org62405ab"><span class="section-number-4">4.3.3</span> Treemacs</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
Enable follow-mode so the treemacs cursor follows the buffer file. Also increase the default width to show more stuff.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> treemacs
  <span style="color: #c678dd;">(</span><span style="color: #dcaeea;">treemacs-follow-mode</span> <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">treemacs-width</span> <span style="color: #da8548; font-weight: bold;">40</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge1fc0e5" class="outline-3">
<h3 id="orge1fc0e5"><span class="section-number-3">4.4</span> Completion</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Fix company causing minibuffer region to disappear (e.g. lsp ask root dialogue).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> company
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">remove-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">evil-normal-state-entry-hook</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">company-abort</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1acd219" class="outline-3">
<h3 id="org1acd219"><span class="section-number-3">4.5</span> Checkers configuration</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-orgff031ca" class="outline-4">
<h4 id="orgff031ca"><span class="section-number-4">4.5.1</span> Flyspell</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Flyspell can create a lot of lag in large buffers. Make it as lazy as possible.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> flyspell <span style="color: #c678dd;">(</span><span style="color: #dcaeea;">flyspell-lazy-mode</span> <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge4afd5a" class="outline-3">
<h3 id="orge4afd5a"><span class="section-number-3">4.6</span> Email configuration (mu4e)</h3>
<div class="outline-text-3" id="text-4-6">
<p>
I am experimenting with <kbd>mu4e</kbd> for my email configuration. I&rsquo;m using it with mbsync as the backend for syncing emails. Note as of 1.4, the root maildir is set via the <code>mu init</code> command so it is unnecessary to set it.
</p>
</div>

<div id="outline-container-org10ec2c7" class="outline-5">
<h5 id="org10ec2c7"><span class="section-number-5">4.6.0.1</span> Prerequisites</h5>
<div class="outline-text-5" id="text-4-6-0-1">
<p>
First run mbsync for the first time to download all mail. Then set up <kbd>mu</kbd>:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ECBE7B;">touch</span> ~/Mail/r-vn.org/Spam/.noindex
mu init --maildir ~/Mail --my-address james@r-vn.org
</pre>
</div>
</div>
</div>
