config.el
  (treemacs-follow-mode 1)
  (setq treemacs-width 40))
;; Treemacs:1 ends here

;; [[file:~/.config/doom/config.org::*Completion][Completion:1]]
(after! company
  (remove-hook 'evil-normal-state-entry-hook #'company-abort))
;; Completion:1 ends here

;; [[file:~/.config/doom/config.org::*Flyspell][Flyspell:1]]
(after! flyspell (flyspell-lazy-mode 1))
;; Flyspell:1 ends here
