config.org
**** Configuration
First, use doom's handy function for setting up an [[https://www.djcbsoftware.nl/code/mu/mu4e/Contexts.html#Contexts][mu4e context]].

#+BEGIN_SRC emacs-lisp
(set-email-account!
 "r-vn.org"
 '((mu4e-sent-folder       . "/r-vn.org/Sent")
   (mu4e-drafts-folder     . "/r-vn.org/Drafts")
   (mu4e-trash-folder      . "/r-vn.org/Trash")
   (mu4e-refile-folder     . "/r-vn.org/Archive")
   (smtpmail-smtp-user     . "james@r-vn.org")
   (mu4e-maildir-shortcuts .
                           ((:maildir "/r-vn.org/INBOX"   :key ?i)
                            (:maildir "/r-vn.org/Archive" :key ?a)
                            (:maildir "/r-vn.org/Trash"   :key ?t)
                            (:maildir "/r-vn.org/Sent"    :key ?s)))
   (smtpmail-smtp-server . "smtp.fastmail.com")
   (smtpmail-stream-type . ssl)
   (smtpmail-smtp-service . 465)
   (smtpmail-default-smtp-server . "smtp.fastmail.com"))
 t)
#+END_SRC

Tweak the general configuration.

#+BEGIN_SRC emacs-lisp
(after! mu4e
  (setq mu4e-attachment-dir "~/Downloads"   ; Attachments in standard place.
        mu4e-headers-include-related nil    ; Only show messages which match the current filter.
        mu4e-headers-fields                 ; Header columns.
        '((:human-date . 12)
          (:flags . 6)
          (:from . 25)
          (:subject))
        mu4e-update-interval 300))          ; Check for mail every 5 minutes.
#+END_SRC

Compose mails with =org-msg=.

#+BEGIN_SRC emacs-lisp
(remove-hook 'mu4e-compose-mode-hook #'org-mu4e-compose-org-mode) ; Don't use org-mu4e.

(use-package org-msg
  :after (org mu4e)
  :hook (mu4e-main-mode . org-msg-mode)
  :config
  (setq org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil \\n:t"
	      org-msg-startup "hidestars indent inlineimages"
	      org-msg-greeting-fmt "\nHi %s,\n\n"
	      org-msg-greeting-name-limit 3
	      org-msg-text-plain-alternative t
        org-msg-signature "

Regards,

,#+begin_signature
-- James
,#+end_signature"))
#+END_SRC

Bind mail to =SPC o m=.

#+BEGIN_SRC emacs-lisp
(map!
 :leader
 :prefix "o"
 :desc "Mail" "m" #'=mu4e)
#+END_SRC

=mu4e= uses =shr= to render HTML to text. Let's tweak its colors so it's a bit easier to see with doom's dark background.

#+BEGIN_SRC emacs-lisp
(setq shr-color-visible-luminance-min 80)
#+END_SRC

Set up mu4e-alert for notifications in the modeline.

#+BEGIN_SRC emacs-lisp
(setq doom-modeline-mu4e t)
(use-package! mu4e-alert
  :after mu4e
  :config
  (mu4e-alert-enable-mode-line-display))
#+END_SRC

** Tools configuration
