config.el

;; [[file:~/.config/doom/config.org::*Configuration][Configuration:1]]
(set-email-account!
 "r-vn.org"
 '((mu4e-sent-folder       . "/r-vn.org/Sent")
   (mu4e-drafts-folder     . "/r-vn.org/Drafts")
   (mu4e-trash-folder      . "/r-vn.org/Trash")
   (mu4e-refile-folder     . "/r-vn.org/Archive")
   (smtpmail-smtp-user     . "james@r-vn.org")
   (mu4e-maildir-shortcuts .
                           ((:maildir "/r-vn.org/INBOX"   :key ?i)
                            (:maildir "/r-vn.org/Archive" :key ?a)
                            (:maildir "/r-vn.org/Trash"   :key ?t)
                            (:maildir "/r-vn.org/Sent"    :key ?s)))
   (smtpmail-smtp-server . "smtp.fastmail.com")
   (smtpmail-stream-type . ssl)
   (smtpmail-smtp-service . 465)
   (smtpmail-default-smtp-server . "smtp.fastmail.com"))
 t)
;; Configuration:1 ends here

;; [[file:~/.config/doom/config.org::*Configuration][Configuration:2]]
(after! mu4e
  (setq mu4e-attachment-dir "~/Downloads"   ; Attachments in standard place.
        mu4e-headers-include-related nil    ; Only show messages which match the current filter.
        mu4e-headers-fields                 ; Header columns.
        '((:human-date . 12)
          (:flags . 6)
          (:from . 25)
          (:subject))
        mu4e-update-interval 300))          ; Check for mail every 5 minutes.
;; Configuration:2 ends here

;; [[file:~/.config/doom/config.org::*Configuration][Configuration:3]]
(remove-hook 'mu4e-compose-mode-hook #'org-mu4e-compose-org-mode) ; Don't use org-mu4e.

(use-package org-msg
  :after (org mu4e)
  :hook (mu4e-main-mode . org-msg-mode)
  :config
  (setq org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil \\n:t"
	      org-msg-startup "hidestars indent inlineimages"
	      org-msg-greeting-fmt "\nHi %s,\n\n"
	      org-msg-greeting-name-limit 3
	      org-msg-text-plain-alternative t
        org-msg-signature "

Regards,

#+begin_signature
-- James
#+end_signature"))
;; Configuration:3 ends here

;; [[file:~/.config/doom/config.org::*Configuration][Configuration:4]]
(map!
 :leader
 :prefix "o"
 :desc "Mail" "m" #'=mu4e)
;; Configuration:4 ends here

;; [[file:~/.config/doom/config.org::*Configuration][Configuration:5]]
(setq shr-color-visible-luminance-min 80)
;; Configuration:5 ends here

;; [[file:~/.config/doom/config.org::*Configuration][Configuration:6]]
(setq doom-modeline-mu4e t)
(use-package! mu4e-alert
  :after mu4e
  :config
  (mu4e-alert-enable-mode-line-display))
;; Configuration:6 ends here

;; [[file:~/.config/doom/config.org::*Language Server Protocol (LSP)][Language Server Protocol (LSP):1]]
(map! :leader
      (:prefix "c"
