config.org
*** Language Server Protocol (LSP)
Add some useful binds.

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix "c"
       :desc "LSP Parameters" "p" #'lsp-signature-activate))
#+END_SRC

Disable the auto root guessing that doom enables by default, but doesn't work very well in my experience. With this
disabled LSP will prompt for the project root when opening a new LSP recognized file. This adds a little
inconvenience, but saves a lot of trouble with golang projects.

#+BEGIN_SRC emacs-lisp
(setq lsp-auto-guess-root nil)
#+END_SRC

Disable symbol highlighting which is just obnoxious, especially in =gopls= where it seems to highlight a lot of things.
This could probably be made more usable with a more subtle highlight color.

#+BEGIN_SRC emacs-lisp
(setq lsp-enable-symbol-highlighting nil)
#+END_SRC

Disable auto-linking which seems [[https://github.com/hlissner/doom-emacs/issues/2911][fundamentally broken]] as it breaks other buffers.

#+BEGIN_SRC emacs-lisp
(setq lsp-enable-links nil)
#+END_SRC

Don't display a giant signature block whenever typing in a function call. This seems to cause a lot of window glitches.
Just display the function.

#+BEGIN_SRC emacs-lisp
(setq lsp-signature-auto-activate t
      lsp-signature-render-documentation nil)
#+END_SRC

Disable the not so great =lsp-mode= snippets which insert optional parameters and other nonsense.

#+BEGIN_SRC emacs-lisp
(setq lsp-enable-snippet nil)
#+END_SRC

Turn on [[https://github.com/emacs-lsp/lsp-mode/wiki/Debugging][LSP Debugging]]. Enable only when needed.

#+BEGIN_SRC emacs-lisp
;(setq lsp-log-io t)
#+END_SRC

*** Magit
Prefer offering remote branches when prompting for a branch selection.

#+BEGIN_SRC emacs-lisp
(setq magit-prefer-remote-upstream t)
#+END_SRC

Limit the number of topics that forge displays. I find the default a bit too large.

#+BEGIN_SRC emacs-lisp
(setq forge-topic-list-limit '(30 . 5))
#+END_SRC

* Languages
This section configures language major modes.

** Golang
Tweak the hover documentation of =gopls= so it shows more information when using ~+lookup/documentation~.

#+BEGIN_SRC emacs-lisp
(setq lsp-gopls-hover-kind "FullDocumentation")
#+END_SRC

** Org Mode
This section tweaks =org-mode= to my own specific needs and workflow. There is a lot of custom stuff here, so
modify/adapt/use as you find useful.

The most important thing is to tell org-mode where my org files are.

#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Dropbox/Notes/")
#+END_SRC

*** General settings
General settings for org-mode interaction.

**** Editor
Allow ~imenu~ to nest fully in org-mode to quickly jump to any heading.

#+BEGIN_SRC emacs-lisp
(setq org-imenu-depth 6)
#+END_SRC

