config.html
<div id="outline-container-orgef2881e" class="outline-4">
<h4 id="orgef2881e"><span class="section-number-4">4.7.1</span> Language Server Protocol (LSP)</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
Add some useful binds.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">map!</span> <span style="color: #c678dd;">:leader</span>
      <span style="color: #c678dd;">(</span><span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">"c"</span>
       <span style="color: #c678dd;">:desc</span> <span style="color: #98be65;">"LSP Parameters"</span> <span style="color: #98be65;">"p"</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">lsp-signature-activate</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Disable the auto root guessing that doom enables by default, but doesn&rsquo;t work very well in my experience. With this
disabled LSP will prompt for the project root when opening a new LSP recognized file. This adds a little
inconvenience, but saves a lot of trouble with golang projects.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">lsp-auto-guess-root</span> nil<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Disable symbol highlighting which is just obnoxious, especially in <kbd>gopls</kbd> where it seems to highlight a lot of things.
This could probably be made more usable with a more subtle highlight color.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">lsp-enable-symbol-highlighting</span> nil<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Disable auto-linking which seems <a href="https://github.com/hlissner/doom-emacs/issues/2911">fundamentally broken</a> as it breaks other buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">lsp-enable-links</span> nil<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Don&rsquo;t display a giant signature block whenever typing in a function call. This seems to cause a lot of window glitches.
Just display the function.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">lsp-signature-auto-activate</span> t
      <span style="color: #dcaeea;">lsp-signature-render-documentation</span> nil<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Disable the not so great <kbd>lsp-mode</kbd> snippets which insert optional parameters and other nonsense.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">lsp-enable-snippet</span> nil<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Turn on <a href="https://github.com/emacs-lsp/lsp-mode/wiki/Debugging">LSP Debugging</a>. Enable only when needed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;</span><span style="color: #5B6268;">(setq lsp-log-io t)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a916a0" class="outline-4">
<h4 id="org9a916a0"><span class="section-number-4">4.7.2</span> Magit</h4>
<div class="outline-text-4" id="text-4-7-2">
<p>
Prefer offering remote branches when prompting for a branch selection.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">magit-prefer-remote-upstream</span> t<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Limit the number of topics that forge displays. I find the default a bit too large.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">forge-topic-list-limit</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">30</span> . <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf2589cd" class="outline-2">
<h2 id="orgf2589cd"><span class="section-number-2">5</span> Languages</h2>
<div class="outline-text-2" id="text-5">
<p>
This section configures language major modes.
</p>
</div>

<div id="outline-container-org270a6f3" class="outline-3">
<h3 id="org270a6f3"><span class="section-number-3">5.1</span> Golang</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Tweak the hover documentation of <kbd>gopls</kbd> so it shows more information when using <code>+lookup/documentation</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">lsp-gopls-hover-kind</span> <span style="color: #98be65;">"FullDocumentation"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org37f7df9" class="outline-3">
<h3 id="org37f7df9"><span class="section-number-3">5.2</span> Org Mode</h3>
<div class="outline-text-3" id="text-5-2">
<p>
This section tweaks <kbd>org-mode</kbd> to my own specific needs and workflow. There is a lot of custom stuff here, so
modify/adapt/use as you find useful.
</p>

<p>
The most important thing is to tell org-mode where my org files are.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-directory</span> <span style="color: #98be65;">"~/Dropbox/Notes/"</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org5ce28c3" class="outline-4">
<h4 id="org5ce28c3"><span class="section-number-4">5.2.1</span> General settings</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
General settings for org-mode interaction.
</p>
</div>

<div id="outline-container-org89a2d29" class="outline-5">
<h5 id="org89a2d29"><span class="section-number-5">5.2.1.1</span> Editor</h5>
<div class="outline-text-5" id="text-5-2-1-1">
<p>
Allow <code>imenu</code> to nest fully in org-mode to quickly jump to any heading.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-imenu-depth</span> <span style="color: #da8548; font-weight: bold;">6</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
