config.el
       :desc "LSP Parameters" "p" #'lsp-signature-activate))
;; Language Server Protocol (LSP):1 ends here

;; [[file:~/.config/doom/config.org::*Language Server Protocol (LSP)][Language Server Protocol (LSP):2]]
(setq lsp-auto-guess-root nil)
;; Language Server Protocol (LSP):2 ends here

;; [[file:~/.config/doom/config.org::*Language Server Protocol (LSP)][Language Server Protocol (LSP):3]]
(setq lsp-enable-symbol-highlighting nil)
;; Language Server Protocol (LSP):3 ends here

;; [[file:~/.config/doom/config.org::*Language Server Protocol (LSP)][Language Server Protocol (LSP):4]]
(setq lsp-enable-links nil)
;; Language Server Protocol (LSP):4 ends here

;; [[file:~/.config/doom/config.org::*Language Server Protocol (LSP)][Language Server Protocol (LSP):5]]
(setq lsp-signature-auto-activate t
      lsp-signature-render-documentation nil)
;; Language Server Protocol (LSP):5 ends here

;; [[file:~/.config/doom/config.org::*Language Server Protocol (LSP)][Language Server Protocol (LSP):6]]
(setq lsp-enable-snippet nil)
;; Language Server Protocol (LSP):6 ends here

;; [[file:~/.config/doom/config.org::*Language Server Protocol (LSP)][Language Server Protocol (LSP):7]]
;(setq lsp-log-io t)
;; Language Server Protocol (LSP):7 ends here

;; [[file:~/.config/doom/config.org::*Magit][Magit:1]]
(setq magit-prefer-remote-upstream t)
;; Magit:1 ends here

;; [[file:~/.config/doom/config.org::*Magit][Magit:2]]
(setq forge-topic-list-limit '(30 . 5))
;; Magit:2 ends here

;; [[file:~/.config/doom/config.org::*Golang][Golang:1]]
(setq lsp-gopls-hover-kind "FullDocumentation")
;; Golang:1 ends here

;; [[file:~/.config/doom/config.org::*Org Mode][Org Mode:1]]
(setq org-directory "~/Dropbox/Notes/")
;; Org Mode:1 ends here

;; [[file:~/.config/doom/config.org::*Editor][Editor:1]]
(setq org-imenu-depth 6)
;; Editor:1 ends here
