config.org
**** Visuals
Make headings appear larger.

#+BEGIN_SRC emacs-lisp
(custom-set-faces!
  '(outline-1 :weight extra-bold :height 1.12)
  '(outline-2 :weight bold :height 1.10)
  '(outline-3 :weight bold :height 1.08)
  '(outline-4 :weight semi-bold :height 1.06)
  '(outline-5 :weight semi-bold :height 1.04)
  '(outline-6 :weight semi-bold :height 1.02)
  '(outline-8 :weight semi-bold)
  '(outline-9 :weight semi-bold))
#+END_SRC

Make org-mode symbols look nicer than the defaults. Shamelessly stolen from
[[https://github.com/hlissner/doom-emacs-private/blob/master/config.el]].

#+BEGIN_SRC emacs-lisp
(setq
 org-ellipsis " ▼ "
 org-superstar-headline-bullets-list '("☰" "☱" "☲" "☳" "☴" "☵" "☶" "☷" "☷" "☷" "☷"))
#+END_SRC

**** Archiving
I prefer to archive tasks into a sub-folder. Also, I want to keep any inherited tags so information is not lost, as I
frequently archive sub-trees.

#+BEGIN_SRC emacs-lisp
(setq org-archive-location (concat org-directory ".archive/%s::"))
(after! org (setq org-archive-subtree-add-inherited-tags t))
#+END_SRC

**** Download
=org-download= makes it easy to download images directly into org files.

I configure it to use my preferred capture method depending on OS.

#+BEGIN_SRC emacs-lisp
(after! org-download
  (setq org-download-screenshot-method
        (cond (IS-MAC "screencapture -i %s")
              (IS-LINUX "~/.config/sway/capture.sh %s"))))
#+END_SRC
**** Exporting (General)
Export more than the default 2 levels. I want all the levels!

#+BEGIN_SRC emacs-lisp
(after! org (setq org-export-headline-levels 6))
#+END_SRC

