config.html

<div id="outline-container-orge70e9cc" class="outline-5">
<h5 id="orge70e9cc"><span class="section-number-5">5.2.1.2</span> Visuals</h5>
<div class="outline-text-5" id="text-5-2-1-2">
<p>
Make headings appear larger.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">custom-set-faces!</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>outline-1 <span style="color: #c678dd;">:weight</span> extra-bold <span style="color: #c678dd;">:height</span> <span style="color: #da8548; font-weight: bold;">1.12</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>outline-2 <span style="color: #c678dd;">:weight</span> bold <span style="color: #c678dd;">:height</span> <span style="color: #da8548; font-weight: bold;">1.10</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>outline-3 <span style="color: #c678dd;">:weight</span> bold <span style="color: #c678dd;">:height</span> <span style="color: #da8548; font-weight: bold;">1.08</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>outline-4 <span style="color: #c678dd;">:weight</span> semi-bold <span style="color: #c678dd;">:height</span> <span style="color: #da8548; font-weight: bold;">1.06</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>outline-5 <span style="color: #c678dd;">:weight</span> semi-bold <span style="color: #c678dd;">:height</span> <span style="color: #da8548; font-weight: bold;">1.04</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>outline-6 <span style="color: #c678dd;">:weight</span> semi-bold <span style="color: #c678dd;">:height</span> <span style="color: #da8548; font-weight: bold;">1.02</span><span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>outline-8 <span style="color: #c678dd;">:weight</span> semi-bold<span style="color: #c678dd;">)</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span>outline-9 <span style="color: #c678dd;">:weight</span> semi-bold<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Make org-mode symbols look nicer than the defaults. Shamelessly stolen from
<a href="https://github.com/hlissner/doom-emacs-private/blob/master/config.el">https://github.com/hlissner/doom-emacs-private/blob/master/config.el</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span>
 <span style="color: #dcaeea;">org-ellipsis</span> <span style="color: #98be65;">" &#9660; "</span>
 <span style="color: #dcaeea;">org-superstar-headline-bullets-list</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"&#9776;"</span> <span style="color: #98be65;">"&#9777;"</span> <span style="color: #98be65;">"&#9778;"</span> <span style="color: #98be65;">"&#9779;"</span> <span style="color: #98be65;">"&#9780;"</span> <span style="color: #98be65;">"&#9781;"</span> <span style="color: #98be65;">"&#9782;"</span> <span style="color: #98be65;">"&#9783;"</span> <span style="color: #98be65;">"&#9783;"</span> <span style="color: #98be65;">"&#9783;"</span> <span style="color: #98be65;">"&#9783;"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec0a448" class="outline-5">
<h5 id="orgec0a448"><span class="section-number-5">5.2.1.3</span> Archiving</h5>
<div class="outline-text-5" id="text-5-2-1-3">
<p>
I prefer to archive tasks into a sub-folder. Also, I want to keep any inherited tags so information is not lost, as I
frequently archive sub-trees.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-archive-location</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">org-directory</span> <span style="color: #98be65;">".archive/%s::"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> org-archive-subtree-add-inherited-tags t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7c1569" class="outline-5">
<h5 id="orge7c1569"><span class="section-number-5">5.2.1.4</span> Download</h5>
<div class="outline-text-5" id="text-5-2-1-4">
<p>
<kbd>org-download</kbd> makes it easy to download images directly into org files.
</p>

<p>
I configure it to use my preferred capture method depending on OS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org-download
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> org-download-screenshot-method
        <span style="color: #98be65;">(</span><span style="color: #51afef;">cond</span> <span style="color: #51afef;">(</span><span style="color: #dcaeea;">IS-MAC</span> <span style="color: #98be65;">"screencapture -i %s"</span><span style="color: #51afef;">)</span>
              <span style="color: #51afef;">(</span><span style="color: #dcaeea;">IS-LINUX</span> <span style="color: #98be65;">"~/.config/sway/capture.sh %s"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org647861d" class="outline-5">
<h5 id="org647861d"><span class="section-number-5">5.2.1.5</span> Exporting (General)</h5>
<div class="outline-text-5" id="text-5-2-1-5">
<p>
Export more than the default 2 levels. I want all the levels!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-export-headline-levels</span> <span style="color: #da8548; font-weight: bold;">6</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
