config.el

;; [[file:~/.config/doom/config.org::*Visuals][Visuals:1]]
(custom-set-faces!
  '(outline-1 :weight extra-bold :height 1.12)
  '(outline-2 :weight bold :height 1.10)
  '(outline-3 :weight bold :height 1.08)
  '(outline-4 :weight semi-bold :height 1.06)
  '(outline-5 :weight semi-bold :height 1.04)
  '(outline-6 :weight semi-bold :height 1.02)
  '(outline-8 :weight semi-bold)
  '(outline-9 :weight semi-bold))
;; Visuals:1 ends here

;; [[file:~/.config/doom/config.org::*Visuals][Visuals:2]]
(setq
 org-ellipsis " ▼ "
 org-superstar-headline-bullets-list '("☰" "☱" "☲" "☳" "☴" "☵" "☶" "☷" "☷" "☷" "☷"))
;; Visuals:2 ends here

;; [[file:~/.config/doom/config.org::*Archiving][Archiving:1]]
(setq org-archive-location (concat org-directory ".archive/%s::"))
(after! org (setq org-archive-subtree-add-inherited-tags t))
;; Archiving:1 ends here

;; [[file:~/.config/doom/config.org::*Download][Download:1]]
(after! org-download
  (setq org-download-screenshot-method
        (cond (IS-MAC "screencapture -i %s")
              (IS-LINUX "~/.config/sway/capture.sh %s"))))
;; Download:1 ends here

;; [[file:~/.config/doom/config.org::*Exporting (General)][Exporting (General):1]]
(after! org (setq org-export-headline-levels 6))
;; Exporting (General):1 ends here
