config.html

<div id="outline-container-org8a60ed0" class="outline-5">
<h5 id="org8a60ed0"><span class="section-number-5">5.2.1.6</span> Exporting to HTML</h5>
<div class="outline-text-5" id="text-5-2-1-6">
<p>
Let&rsquo;s make HTML look nicer. This is all taken from <a href="https://tecosaur.github.io/emacs-config/config.html#OrgModeVisuals">tecosaur&rsquo;s org-mode config</a>, which is based on <a href="https://github.com/fniessen/org-html-themes">fniessen/org-html-themes</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">jsravn--org-inline-css-hook</span> <span style="color: #c678dd;">(</span>exporter<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"Insert custom inline css to automatically set the</span>
<span style="color: #83898d;">   background of code to whatever theme I'm using's background"</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">when</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">eq</span> exporter <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">html</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">setq</span>
     <span style="color: #dcaeea;">org-html-head-extra</span>
     <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">concat</span>
      <span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">s-contains-p</span> <span style="color: #98be65;">"&lt;!&#8211;&#8211;tec/custom-head-start--&gt;"</span> <span style="color: #dcaeea;">org-html-head-extra</span><span style="color: #98be65;">)</span>
          <span style="color: #98be65;">(</span><span style="color: #c678dd;">s-replace-regexp</span> <span style="color: #98be65;">"&lt;!&#8211;&#8211;tec/custom-head-start--&gt;.*&lt;!&#8211;&#8211;tec/custom-head-end--&gt;"</span> <span style="color: #98be65;">""</span> <span style="color: #dcaeea;">org-html-head-extra</span><span style="color: #98be65;">)</span>
        <span style="color: #dcaeea;">org-html-head-extra</span><span style="color: #c678dd;">)</span>
      <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">format</span> <span style="color: #98be65;">"&lt;!&#8211;&#8211;tec/custom-head-start--&gt;</span>
<span style="color: #98be65;">&lt;style type=\"text/css\"&gt;</span>
<span style="color: #98be65;">   :root {</span>
<span style="color: #98be65;">      --theme-bg: %s;</span>
<span style="color: #98be65;">      --theme-bg-alt: %s;</span>
<span style="color: #98be65;">      --theme-base0: %s;</span>
<span style="color: #98be65;">      --theme-base1: %s;</span>
<span style="color: #98be65;">      --theme-base2: %s;</span>
<span style="color: #98be65;">      --theme-base3: %s;</span>
<span style="color: #98be65;">      --theme-base4: %s;</span>
<span style="color: #98be65;">      --theme-base5: %s;</span>
<span style="color: #98be65;">      --theme-base6: %s;</span>
<span style="color: #98be65;">      --theme-base7: %s;</span>
<span style="color: #98be65;">      --theme-base8: %s;</span>
<span style="color: #98be65;">      --theme-fg: %s;</span>
<span style="color: #98be65;">      --theme-fg-alt: %s;</span>
<span style="color: #98be65;">      --theme-grey: %s;</span>
<span style="color: #98be65;">      --theme-red: %s;</span>
<span style="color: #98be65;">      --theme-orange: %s;</span>
<span style="color: #98be65;">      --theme-green: %s;</span>
<span style="color: #98be65;">      --theme-teal: %s;</span>
<span style="color: #98be65;">      --theme-yellow: %s;</span>
<span style="color: #98be65;">      --theme-blue: %s;</span>
<span style="color: #98be65;">      --theme-dark-blue: %s;</span>
<span style="color: #98be65;">      --theme-magenta: %s;</span>
<span style="color: #98be65;">      --theme-violet: %s;</span>
<span style="color: #98be65;">      --theme-cyan: %s;</span>
<span style="color: #98be65;">      --theme-dark-cyan: %s;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">&lt;/style&gt;"</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">bg</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">bg-alt</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base0</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base1</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base2</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base3</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base4</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base5</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base6</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base7</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">base8</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">fg</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">fg-alt</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">grey</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">red</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">orange</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">green</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">teal</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">yellow</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">blue</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">dark-blue</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">magenta</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">violet</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">cyan</span><span style="color: #98be65;">)</span>
              <span style="color: #98be65;">(</span><span style="color: #c678dd;">doom-color</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">dark-cyan</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
      <span style="color: #98be65;">"</span>
<span style="color: #98be65;">&lt;link rel='stylesheet' type='text/css' href='https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css'/&gt;</span>
<span style="color: #98be65;">&lt;link rel='stylesheet' type='text/css' href='https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css'/&gt;</span>

<span style="color: #98be65;">&lt;script src='https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js'&gt;&lt;/script&gt;</span>
<span style="color: #98be65;">&lt;script src='https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js'&gt;&lt;/script&gt;</span>
<span style="color: #98be65;">&lt;script type='text/javascript' src='https://fniessen.github.io/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js'&gt;&lt;/script&gt;</span>
<span style="color: #98be65;">&lt;script type='text/javascript' src='https://fniessen.github.io/org-html-themes/styles/readtheorg/js/readtheorg.js'&gt;&lt;/script&gt;</span>

<span style="color: #98be65;">&lt;style&gt;</span>
<span style="color: #98be65;">   pre.src {</span>
<span style="color: #98be65;">     background-color: var(--theme-bg);</span>
<span style="color: #98be65;">     color: var(--theme-fg);</span>
<span style="color: #98be65;">     scrollbar-color:#bbb6#9992;</span>
<span style="color: #98be65;">     scrollbar-width: thin;</span>
<span style="color: #98be65;">     margin: 0;</span>
<span style="color: #98be65;">     border: none;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   div.org-src-container {</span>
<span style="color: #98be65;">     border-radius: 12px;</span>
<span style="color: #98be65;">     overflow: hidden;</span>
<span style="color: #98be65;">     margin-bottom: 24px;</span>
<span style="color: #98be65;">     margin-top: 1px;</span>
<span style="color: #98be65;">     border: 1px solid#e1e4e5;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   pre.src::before {</span>
<span style="color: #98be65;">     background-color:#6666;</span>
<span style="color: #98be65;">     top: 8px;</span>
<span style="color: #98be65;">     border: none;</span>
<span style="color: #98be65;">     border-radius: 5px;</span>
<span style="color: #98be65;">     line-height: 1;</span>
<span style="color: #98be65;">     border: 2px solid var(--theme-bg);</span>
<span style="color: #98be65;">     opacity: 0;</span>
<span style="color: #98be65;">     transition: opacity 200ms;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   pre.src:hover::before { opacity: 1; }</span>
<span style="color: #98be65;">   pre.src:active::before { opacity: 0; }</span>

<span style="color: #98be65;">   pre.example {</span>
<span style="color: #98be65;">     border-radius: 12px;</span>
<span style="color: #98be65;">     background: var(--theme-bg-alt);</span>
<span style="color: #98be65;">     color: var(--theme-fg);</span>
<span style="color: #98be65;">   }</span>

<span style="color: #98be65;">   code {</span>
<span style="color: #98be65;">     border-radius: 5px;</span>
<span style="color: #98be65;">     background:#e8e8e8;</span>
<span style="color: #98be65;">     font-size: 80%;</span>
<span style="color: #98be65;">   }</span>

<span style="color: #98be65;">   kbd {</span>
<span style="color: #98be65;">     display: inline-block;</span>
<span style="color: #98be65;">     padding: 3px 5px;</span>
<span style="color: #98be65;">     font: 80% SFMono-Regular,Consolas,Liberation Mono,Menlo,monospace;</span>
<span style="color: #98be65;">     line-height: normal;</span>
<span style="color: #98be65;">     line-height: 10px;</span>
<span style="color: #98be65;">     color:#444d56;</span>
<span style="color: #98be65;">     vertical-align: middle;</span>
<span style="color: #98be65;">     background-color:#fafbfc;</span>
<span style="color: #98be65;">     border: 1px solid#d1d5da;</span>
<span style="color: #98be65;">     border-radius: 3px;</span>
<span style="color: #98be65;">     box-shadow: inset 0 -1px 0#d1d5da;</span>
<span style="color: #98be65;">   }</span>

<span style="color: #98be65;">   table {</span>
<span style="color: #98be65;">     max-width: 100%;</span>
<span style="color: #98be65;">     overflow-x: auto;</span>
<span style="color: #98be65;">     display: block;</span>
<span style="color: #98be65;">     border-top: none;</span>
<span style="color: #98be65;">   }</span>

<span style="color: #98be65;">   a {</span>
<span style="color: #98be65;">       text-decoration: none;</span>
<span style="color: #98be65;">       background-image: linear-gradient(#d8dce9, #d8dce9);</span>
<span style="color: #98be65;">       background-position: 0% 100%;</span>
<span style="color: #98be65;">       background-repeat: no-repeat;</span>
<span style="color: #98be65;">       background-size: 0% 2px;</span>
<span style="color: #98be65;">       transition: background-size .3s;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   </span><span style="color: #ECBE7B;">\</span><span style="color: #98be65;">#table-of-contents a {</span>
<span style="color: #98be65;">       background-image: none;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   a:hover, a:focus {</span>
<span style="color: #98be65;">       background-size: 100% 2px;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   a[href^='#'] { font-variant-numeric: oldstyle-nums; }</span>
<span style="color: #98be65;">   a[href^='#']:visited { color:#3091d1; }</span>

<span style="color: #98be65;">   li .checkbox {</span>
<span style="color: #98be65;">       display: inline-block;</span>
<span style="color: #98be65;">       width: 0.9em;</span>
<span style="color: #98be65;">       height: 0.9em;</span>
<span style="color: #98be65;">       border-radius: 3px;</span>
<span style="color: #98be65;">       margin: 3px;</span>
<span style="color: #98be65;">       top: 4px;</span>
<span style="color: #98be65;">       position: relative;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   li.on &gt; .checkbox { background: var(--theme-green); box-shadow: 0 0 2px var(--theme-green); }</span>
<span style="color: #98be65;">   li.trans &gt; .checkbox { background: var(--theme-orange); box-shadow: 0 0 2px var(--theme-orange); }</span>
<span style="color: #98be65;">   li.off &gt; .checkbox { background: var(--theme-red); box-shadow: 0 0 2px var(--theme-red); }</span>
<span style="color: #98be65;">   li.on &gt; .checkbox::after {</span>
<span style="color: #98be65;">     content: '';</span>
<span style="color: #98be65;">     height: 0.45em;</span>
<span style="color: #98be65;">     width: 0.225em;</span>
<span style="color: #98be65;">     -webkit-transform-origin: left top;</span>
<span style="color: #98be65;">     transform-origin: left top;</span>
<span style="color: #98be65;">     transform: scaleX(-1) rotate(135deg);</span>
<span style="color: #98be65;">     border-right: 2.8px solid#fff;</span>
<span style="color: #98be65;">     border-top: 2.8px solid#fff;</span>
<span style="color: #98be65;">     opacity: 0.9;</span>
<span style="color: #98be65;">     left: 0.10em;</span>
<span style="color: #98be65;">     top: 0.45em;</span>
<span style="color: #98be65;">     position: absolute;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   li.trans &gt; .checkbox::after {</span>
<span style="color: #98be65;">       content: '';</span>
<span style="color: #98be65;">       font-weight: bold;</span>
<span style="color: #98be65;">       font-size: 1.6em;</span>
<span style="color: #98be65;">       position: absolute;</span>
<span style="color: #98be65;">       top: 0.23em;</span>
<span style="color: #98be65;">       left: 0.09em;</span>
<span style="color: #98be65;">       width: 0.35em;</span>
<span style="color: #98be65;">       height: 0.12em;</span>
<span style="color: #98be65;">       background:#fff;</span>
<span style="color: #98be65;">       opacity: 0.9;</span>
<span style="color: #98be65;">       border-radius: 0.1em;</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">   li.off &gt; .checkbox::after {</span>
<span style="color: #98be65;">    content: '&#10006;';</span>
<span style="color: #98be65;">    color:#fff;</span>
<span style="color: #98be65;">    opacity: 0.9;</span>
<span style="color: #98be65;">    position: relative;</span>
<span style="color: #98be65;">    top: -0.40rem;</span>
<span style="color: #98be65;">    left: 0.17em;</span>
<span style="color: #98be65;">    font-size: 0.75em;</span>
<span style="color: #98be65;">  }</span>

<span style="color: #98be65;">   span.timestamp {</span>
<span style="color: #98be65;">       color: #003280;</span>
<span style="color: #98be65;">       background: #647CFF44;</span>
<span style="color: #98be65;">       border-radius: 3px;</span>
<span style="color: #98be65;">       line-height: 1.25;</span>
<span style="color: #98be65;">   }</span>

<span style="color: #98be65;">   </span><span style="color: #ECBE7B;">\</span><span style="color: #98be65;">#table-of-contents { overflow-y: auto; }</span>
<span style="color: #98be65;">   blockquote p { margin: 8px 0px 16px 0px; }</span>
<span style="color: #98be65;">   </span><span style="color: #ECBE7B;">\</span><span style="color: #98be65;">#postamble .date { color: var(--theme-green); }</span>

<span style="color: #98be65;">   ::-webkit-scrollbar { width: 10px; height: 8px; }</span>
<span style="color: #98be65;">   ::-webkit-scrollbar-track { background:#9992; }</span>
<span style="color: #98be65;">   ::-webkit-scrollbar-thumb { background:#ccc; border-radius: 10px; }</span>
<span style="color: #98be65;">   ::-webkit-scrollbar-thumb:hover { background:#888; }</span>
<span style="color: #98be65;">&lt;/style&gt;</span>
<span style="color: #98be65;">&lt;!&#8211;&#8211;tec/custom-head-end--&gt;</span>
<span style="color: #98be65;">"</span>
      <span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #c678dd;">add-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-export-before-processing-hook</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">jsravn--org-inline-css-hook</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And tweak the markup classes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-html-text-markup-alist</span>
      <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>bold . <span style="color: #98be65;">"&lt;b&gt;%s&lt;/b&gt;"</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>code . <span style="color: #98be65;">"&lt;code&gt;%s&lt;/code&gt;"</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>italic . <span style="color: #98be65;">"&lt;i&gt;%s&lt;/i&gt;"</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>strike-through . <span style="color: #98be65;">"&lt;del&gt;%s&lt;/del&gt;"</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>underline . <span style="color: #98be65;">"&lt;span class=\"underline\"&gt;%s&lt;/span&gt;"</span><span style="color: #98be65;">)</span>
        <span style="color: #98be65;">(</span>verbatim . <span style="color: #98be65;">"&lt;kbd&gt;%s&lt;/kbd&gt;"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And use nicer check boxes. <span class="underline">This doesn&rsquo;t work.</span>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(after! org</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(appendq! org-html-checkbox-types</span>
<span style="color: #5B6268;">;;             </span><span style="color: #5B6268;">'((html-span .</span>
<span style="color: #5B6268;">;;                          </span><span style="color: #5B6268;">((on . "&lt;span class='checkbox'&gt;&lt;/span&gt;")</span>
<span style="color: #5B6268;">;;                           </span><span style="color: #5B6268;">(off . "&lt;span class='checkbox'&gt;&lt;/span&gt;")</span>
<span style="color: #5B6268;">;;                           </span><span style="color: #5B6268;">(trans . "&lt;span class='checkbox'&gt;&lt;/span&gt;")))))</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(setq org-html-checkbox-type 'html-span))</span>
</pre>
</div>
</div>
</div>
