config.org
**** Exporting to Beamer
Use a different theme.

#+BEGIN_SRC emacs-lisp
(setq org-beamer-theme "[progressbar=foot]metropolis")
#+END_SRC

And divide presentation into subheadings.

#+BEGIN_SRC emacs-lisp
(setq org-beamer-frame-level 2)
#+END_SRC

**** Exporting to GFM
GFM exports to markdown. Let's enable it.

#+BEGIN_SRC emacs-lisp
(eval-after-load "org"
  '(require 'ox-gfm nil t))
#+END_SRC

*** Task management
I follow my own take on GTD for task management. The task management is independent of notes, and the task files are kept
in the main ~org-directory~. The files are:

- inbox.org    :: Captures go here for later filing. I use =beorg= on my phone to capture things quickly on the fly.
- todo.org     :: The primary TODO list, with all actively worked on projects and TODO items.
- ticklers.org :: Periodic reminders and tasks to be worked on later.
- someday.org  :: I'll do these things one day, maybe.

Each file is organized into a heading per context like this:

- * Home :@home:
- * Work :@work:
- * OMSCS :@omscs:

By using headlines in each folder, I can simply refile tasks under the appropriate heading and they'll automatically
inherit the context tag. It also makes it easier to focus on tasks for a specific context, GTD style, when in the org
file.

My high level task process then is:
1. Once or twice a day, open up the all agenda (=SPC o A A=).
2. Refile everything in the inbox section appropriately.
3. Anything in the schedule that needs doing is moved from =ticklers.org= to =todo.org= which removes it from the schedule.
4. Whenever I need to see what task to pick up, I open up the context specific agenda. E.g. =SPC o A h= for =@home=.
5. Finished tasks are archived (=d A= in agenda, or =SPC m A= in org-mode). If they are recurring tasks, they are refiled back to =ticklers.org=.

**** Capture templates
These are my custom templates for capturing new tasks quickly to the inbox.

#+BEGIN_SRC emacs-lisp
(after! org
  (setq org-capture-templates
        `(("t" "Todo [inbox]" entry
           (file ,(concat org-directory "inbox.org"))
           "* TODO %i%?")
          ("e" "Event [inbox]" entry
           (file ,(concat org-directory "inbox.org"))
           "* %i%? \n %U")
          ("n" "Note [inbox]" entry
           (file ,(concat org-directory "inbox.org"))
           "* %?")
          ("s" "Shopping [todo]" checkitem
           (file+olp ,(concat org-directory "someday.org") "Home" "Shopping")
           "- [ ] %?"))))
#+END_SRC
**** Task settings
Define the =TODO= states and also mark complete items with the current time.

#+BEGIN_SRC emacs-lisp
(after! org
  (setq
   org-todo-keywords '((sequence "TODO(t)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)"))
   org-log-done 'time))
#+END_SRC

**** Contexts
I use tags to primarily set contexts, following the GTD process. I have =@work=, =@home=, and =@omscs=. I configure
tag selection, =C-c C-c=, to quickly pick one of these contexts.

#+BEGIN_SRC emacs-lisp
(after! org
  (setq
   org-tag-alist '(("@work" . ?w) ("@home" . ?h) ("@omscs" . ?o))
   org-fast-tag-selection-single-key t))
#+END_SRC

