config.html

<div id="outline-container-org2ee9124" class="outline-5">
<h5 id="org2ee9124"><span class="section-number-5">5.2.1.7</span> Exporting to Beamer</h5>
<div class="outline-text-5" id="text-5-2-1-7">
<p>
Use a different theme.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> org-beamer-theme <span style="color: #98be65;">"[progressbar=foot]metropolis"</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And divide presentation into subheadings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> org-beamer-frame-level <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7683973" class="outline-5">
<h5 id="org7683973"><span class="section-number-5">5.2.1.8</span> Exporting to GFM</h5>
<div class="outline-text-5" id="text-5-2-1-8">
<p>
GFM exports to markdown. Let&rsquo;s enable it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #c678dd;">eval-after-load</span> <span style="color: #98be65;">"org"</span>
  <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #51afef;">require</span> <span style="color: #51afef;">'</span><span style="color: #a9a1e1;">ox-gfm</span> nil t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5d21efb" class="outline-4">
<h4 id="org5d21efb"><span class="section-number-4">5.2.2</span> Task management</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
I follow my own take on GTD for task management. The task management is independent of notes, and the task files are kept
in the main <code>org-directory</code>. The files are:
</p>

<dl class="org-dl">
<dt>inbox.org   </dt><dd>Captures go here for later filing. I use <kbd>beorg</kbd> on my phone to capture things quickly on the fly.</dd>
<dt>todo.org    </dt><dd>The primary TODO list, with all actively worked on projects and TODO items.</dd>
<dt>ticklers.org</dt><dd>Periodic reminders and tasks to be worked on later.</dd>
<dt>someday.org </dt><dd>I&rsquo;ll do these things one day, maybe.</dd>
</dl>

<p>
Each file is organized into a heading per context like this:
</p>

<ul class="org-ul">
<li>* Home :@home:</li>
<li>* Work :@work:</li>
<li>* OMSCS :@omscs:</li>
</ul>

<p>
By using headlines in each folder, I can simply refile tasks under the appropriate heading and they&rsquo;ll automatically
inherit the context tag. It also makes it easier to focus on tasks for a specific context, GTD style, when in the org
file.
</p>

<p>
My high level task process then is:
</p>
<ol class="org-ol">
<li>Once or twice a day, open up the all agenda (<kbd>SPC o A A</kbd>).</li>
<li>Refile everything in the inbox section appropriately.</li>
<li>Anything in the schedule that needs doing is moved from <kbd>ticklers.org</kbd> to <kbd>todo.org</kbd> which removes it from the schedule.</li>
<li>Whenever I need to see what task to pick up, I open up the context specific agenda. E.g. <kbd>SPC o A h</kbd> for <kbd>@home</kbd>.</li>
<li>Finished tasks are archived (<kbd>d A</kbd> in agenda, or <kbd>SPC m A</kbd> in org-mode). If they are recurring tasks, they are refiled back to <kbd>ticklers.org</kbd>.</li>
</ol>
</div>

<div id="outline-container-orgd572363" class="outline-5">
<h5 id="orgd572363"><span class="section-number-5">5.2.2.1</span> Capture templates</h5>
<div class="outline-text-5" id="text-5-2-2-1">
<p>
These are my custom templates for capturing new tasks quickly to the inbox.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-capture-templates</span>
        <span style="color: #51afef;">`</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"t"</span> <span style="color: #98be65;">"Todo [inbox]"</span> entry
           <span style="color: #c678dd;">(</span>file ,<span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">org-directory</span> <span style="color: #98be65;">"inbox.org"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
           <span style="color: #98be65;">"* </span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #98be65;"> %i%?"</span><span style="color: #51afef;">)</span>
          <span style="color: #51afef;">(</span><span style="color: #98be65;">"e"</span> <span style="color: #98be65;">"Event [inbox]"</span> entry
           <span style="color: #c678dd;">(</span>file ,<span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">org-directory</span> <span style="color: #98be65;">"inbox.org"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
           <span style="color: #98be65;">"* %i%? \n %U"</span><span style="color: #51afef;">)</span>
          <span style="color: #51afef;">(</span><span style="color: #98be65;">"n"</span> <span style="color: #98be65;">"Note [inbox]"</span> entry
           <span style="color: #c678dd;">(</span>file ,<span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">org-directory</span> <span style="color: #98be65;">"inbox.org"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
           <span style="color: #98be65;">"* %?"</span><span style="color: #51afef;">)</span>
          <span style="color: #51afef;">(</span><span style="color: #98be65;">"s"</span> <span style="color: #98be65;">"Shopping [todo]"</span> checkitem
           <span style="color: #c678dd;">(</span>file+olp ,<span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">org-directory</span> <span style="color: #98be65;">"someday.org"</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">"Home"</span> <span style="color: #98be65;">"Shopping"</span><span style="color: #c678dd;">)</span>
           <span style="color: #98be65;">"- [ ] %?"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org64f196f" class="outline-5">
<h5 id="org64f196f"><span class="section-number-5">5.2.2.2</span> Task settings</h5>
<div class="outline-text-5" id="text-5-2-2-2">
<p>
Define the <kbd>TODO</kbd> states and also mark complete items with the current time.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span>
   <span style="color: #dcaeea;">org-todo-keywords</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span>sequence <span style="color: #98be65;">"</span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #98be65;">(t)"</span> <span style="color: #98be65;">"WAITING(w)"</span> <span style="color: #98be65;">"|"</span> <span style="color: #98be65;">"DONE(d)"</span> <span style="color: #98be65;">"CANCELLED(c)"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
   <span style="color: #dcaeea;">org-log-done</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">time</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6639a49" class="outline-5">
<h5 id="org6639a49"><span class="section-number-5">5.2.2.3</span> Contexts</h5>
<div class="outline-text-5" id="text-5-2-2-3">
<p>
I use tags to primarily set contexts, following the GTD process. I have <kbd>@work</kbd>, <kbd>@home</kbd>, and <kbd>@omscs</kbd>. I configure
tag selection, <kbd>C-c C-c</kbd>, to quickly pick one of these contexts.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span>
   <span style="color: #dcaeea;">org-tag-alist</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"@work"</span> . ?w<span style="color: #51afef;">)</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"@home"</span> . ?h<span style="color: #51afef;">)</span> <span style="color: #51afef;">(</span><span style="color: #98be65;">"@omscs"</span> . ?o<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
   <span style="color: #dcaeea;">org-fast-tag-selection-single-key</span> t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
