config.el

;; [[file:~/.config/doom/config.org::*Exporting to Beamer][Exporting to Beamer:1]]
(setq org-beamer-theme "[progressbar=foot]metropolis")
;; Exporting to Beamer:1 ends here

;; [[file:~/.config/doom/config.org::*Exporting to Beamer][Exporting to Beamer:2]]
(setq org-beamer-frame-level 2)
;; Exporting to Beamer:2 ends here

;; [[file:~/.config/doom/config.org::*Exporting to GFM][Exporting to GFM:1]]
(eval-after-load "org"
  '(require 'ox-gfm nil t))
;; Exporting to GFM:1 ends here

;; [[file:~/.config/doom/config.org::*Capture templates][Capture templates:1]]
(after! org
  (setq org-capture-templates
        `(("t" "Todo [inbox]" entry
           (file ,(concat org-directory "inbox.org"))
           "* TODO %i%?")
          ("e" "Event [inbox]" entry
           (file ,(concat org-directory "inbox.org"))
           "* %i%? \n %U")
          ("n" "Note [inbox]" entry
           (file ,(concat org-directory "inbox.org"))
           "* %?")
          ("s" "Shopping [todo]" checkitem
           (file+olp ,(concat org-directory "someday.org") "Home" "Shopping")
           "- [ ] %?"))))
;; Capture templates:1 ends here

;; [[file:~/.config/doom/config.org::*Task settings][Task settings:1]]
(after! org
  (setq
   org-todo-keywords '((sequence "TODO(t)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)"))
   org-log-done 'time))
;; Task settings:1 ends here

;; [[file:~/.config/doom/config.org::*Contexts][Contexts:1]]
(after! org
  (setq
   org-tag-alist '(("@work" . ?w) ("@home" . ?h) ("@omscs" . ?o))
   org-fast-tag-selection-single-key t))
;; Contexts:1 ends here

;; [[file:~/.config/doom/config.org::*Refile targets][Refile targets:1]]
(after! org
  (setq
