config.html

<div id="outline-container-org3fc3309" class="outline-5">
<h5 id="org3fc3309"><span class="section-number-5">5.2.2.4</span> Refile targets</h5>
<div class="outline-text-5" id="text-5-2-2-4">
<p>
Define targets for potential refile. This is part of my GTD system and allows quickly moving tasks between the core task
files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span>
   <span style="color: #dcaeea;">org-refile-targets</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/todo.org"</span> <span style="color: #c678dd;">:maxlevel</span> . <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #51afef;">)</span>
                        <span style="color: #51afef;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/someday.org"</span> <span style="color: #c678dd;">:maxlevel</span> . <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">)</span>
                        <span style="color: #51afef;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/tickler.org"</span> <span style="color: #c678dd;">:maxlevel</span> . <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #51afef;">)</span>
                        <span style="color: #51afef;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/notes.org"</span> <span style="color: #c678dd;">:maxlevel</span> . <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb981a2" class="outline-5">
<h5 id="orgdb981a2"><span class="section-number-5">5.2.2.5</span> Habits</h5>
<div class="outline-text-5" id="text-5-2-2-5">
<p>
Enable org-habit to allow special scheduled items for helping me create habits. To use, create a recurring <kbd>SCHEDULED</kbd> item with
the <kbd>STYLE</kbd> property (<kbd>C-x C-p</kbd>) set to <kbd>habit</kbd>.  See <a href="https://orgmode.org/manual/Tracking-your-habits.html">Tracking your habits</a> for more details.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">add-to-list</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-modules</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">org-habit</span> t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org883ce6c" class="outline-5">
<h5 id="org883ce6c"><span class="section-number-5">5.2.2.6</span> Custom Agendas</h5>
<div class="outline-text-5" id="text-5-2-2-6">
<p>
The agendas are my central view on tasks. There are separate subsections for each agenda view, defined as a function.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-agenda-custom-commands</span>
        <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">list</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">jsravn--all-agenda</span><span style="color: #51afef;">)</span>
              <span style="color: #51afef;">(</span><span style="color: #c678dd;">jsravn--agenda</span> <span style="color: #98be65;">"home"</span><span style="color: #51afef;">)</span>
              <span style="color: #51afef;">(</span><span style="color: #c678dd;">jsravn--agenda</span> <span style="color: #98be65;">"work"</span><span style="color: #51afef;">)</span>
              <span style="color: #51afef;">(</span><span style="color: #c678dd;">jsravn--agenda</span> <span style="color: #98be65;">"omscs"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Also, give me two weeks warning of impending deadlines.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-deadline-warning-days</span> <span style="color: #da8548; font-weight: bold;">14</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgaa0e4bb" class="outline-6">
<h6 id="orgaa0e4bb"><span class="section-number-6">5.2.2.6.1</span> All Agenda Function</h6>
<div class="outline-text-6" id="text-5-2-2-6-1">
<p>
This is my all agenda function. It shows everything going on in my task system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">jsravn--all-agenda</span> <span style="color: #c678dd;">()</span>
  <span style="color: #83898d;">"Custom all agenda."</span>
  <span style="color: #51afef;">`</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"A"</span> <span style="color: #98be65;">"All agenda"</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">(</span>todo <span style="color: #98be65;">""</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #dcaeea;">org-agenda-files</span> <span style="color: #51afef;">'</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/inbox.org"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
               <span style="color: #98be65;">(</span><span style="color: #dcaeea;">org-agenda-overriding-header</span> <span style="color: #98be65;">"Inbox"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
     <span style="color: #51afef;">(</span>tags <span style="color: #98be65;">"-{.*}"</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #dcaeea;">org-agenda-files</span> <span style="color: #51afef;">'</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/todo.org"</span>
                                        <span style="color: #98be65;">"~/Dropbox/Notes/tickler.org"</span>
                                        <span style="color: #98be65;">"~/Dropbox/Notes/someday.org"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                    <span style="color: #98be65;">(</span><span style="color: #dcaeea;">org-agenda-overriding-header</span> <span style="color: #98be65;">"Untagged"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
     <span style="color: #51afef;">(</span>agenda <span style="color: #98be65;">""</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #dcaeea;">org-agenda-span</span> <span style="color: #da8548; font-weight: bold;">7</span><span style="color: #98be65;">)</span>
                 <span style="color: #98be65;">(</span><span style="color: #dcaeea;">org-agenda-start-day</span> <span style="color: #98be65;">"-1d"</span><span style="color: #98be65;">)</span>
                 <span style="color: #98be65;">(</span><span style="color: #dcaeea;">org-agenda-files</span> <span style="color: #51afef;">'</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/tickler.org"</span>
                                     <span style="color: #98be65;">"~/Dropbox/Notes/todo.org"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
                 <span style="color: #98be65;">(</span><span style="color: #dcaeea;">org-agenda-skip-function</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">jsravn--skip-scheduled-if-in-todo</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
     ,<span style="color: #51afef;">(</span><span style="color: #c678dd;">jsravn--tags-todo</span> <span style="color: #98be65;">"@home"</span> <span style="color: #98be65;">"Home"</span><span style="color: #51afef;">)</span>
     ,<span style="color: #51afef;">(</span><span style="color: #c678dd;">jsravn--tags-todo</span> <span style="color: #98be65;">"@work"</span> <span style="color: #98be65;">"Work"</span><span style="color: #51afef;">)</span>
     ,<span style="color: #51afef;">(</span><span style="color: #c678dd;">jsravn--tags-todo</span> <span style="color: #98be65;">"@omscs"</span> <span style="color: #98be65;">"OMSCS"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
