config.html

<div id="outline-container-org2b3ebbc" class="outline-6">
<h6 id="org2b3ebbc"><span class="section-number-6">5.2.2.6.2</span> Context Agenda Function</h6>
<div class="outline-text-6" id="text-5-2-2-6-2">
<p>
This is my per-context agenda function. It is a slimmed down version of the <a href="#orgaa0e4bb">All Agenda Function</a> that scopes to a
context, like <kbd>@home</kbd>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">jsravn--agenda</span> <span style="color: #c678dd;">(</span>scope<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"Custom scoped agenda."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">(</span>key <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">substring</span> scope <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
        <span style="color: #51afef;">(</span>title <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">upcase-initials</span> scope<span style="color: #98be65;">)</span> <span style="color: #98be65;">"agenda"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
        <span style="color: #51afef;">(</span>tag <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #98be65;">"@"</span> scope<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #51afef;">`</span><span style="color: #98be65;">(</span>,key ,title
           <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span>agenda <span style="color: #98be65;">""</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">org-agenda-span</span> <span style="color: #da8548; font-weight: bold;">7</span><span style="color: #51afef;">)</span>
                        <span style="color: #51afef;">(</span><span style="color: #dcaeea;">org-agenda-start-day</span> <span style="color: #98be65;">"-1d"</span><span style="color: #51afef;">)</span>
                        <span style="color: #51afef;">(</span><span style="color: #dcaeea;">org-agenda-files</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/tickler.org"</span>
                                            <span style="color: #98be65;">"~/Dropbox/Notes/todo.org"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
                        <span style="color: #51afef;">(</span><span style="color: #dcaeea;">org-agenda-skip-function</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">jsravn--skip-scheduled-if-in-todo</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
            ,<span style="color: #c678dd;">(</span><span style="color: #c678dd;">jsravn--tags-todo</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> tag <span style="color: #98be65;">"/!</span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #98be65;">"</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">"Todo"</span><span style="color: #c678dd;">)</span>
            ,<span style="color: #c678dd;">(</span><span style="color: #c678dd;">jsravn--tags-todo</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">concat</span> tag <span style="color: #98be65;">"/!WAITING"</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">"Waiting"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
           <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #dcaeea;">org-agenda-tag-filter-preset</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>,<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #98be65;">"+"</span> tag<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
