config.org
***** Agenda Support Functions
I have a few support functions for the agendas.

This is a custom ~tags-todo~ view which only shows the first TODO in a subheading, aka project.

#+BEGIN_SRC emacs-lisp
(defun jsravn--tags-todo (tags header)
  "Customized tags-todo view which only shows the first TODO in a subheading."
  `(tags-todo ,tags ((org-agenda-files '("~/Dropbox/Notes/todo.org"))
                     (org-agenda-overriding-header ,header)
                     (org-agenda-skip-function #'jsravn--skip-all-siblings-but-first))))

(defun jsravn--skip-all-siblings-but-first ()
  "Skip all but the first non-done entry that is inside a subheading."
  (when (> (car (org-heading-components)) 2)
    (let (should-skip-entry)
      (save-excursion
        (while (and (not should-skip-entry) (org-goto-sibling t))
          (when (string= "TODO" (org-get-todo-state))
            (setq should-skip-entry t))))
      (when should-skip-entry
        (or (outline-next-heading) (goto-char (point-max)))))))
#+END_SRC

This a custom filter that skips any =SCHEDULED= items which have already been filed in my =todo.org=.

#+BEGIN_SRC emacs-lisp
(defun jsravn--skip-scheduled-if-in-todo ()
  "Skip scheduled items that have been moved to todo.org."
  (when (and (string= "todo.org" (file-name-nondirectory (buffer-file-name)))
             (org-entry-get nil "SCHEDULED"))
    (or (outline-next-heading) (goto-char (point-max)))))
#+END_SRC

**** Agenda Searches
Agenda search is usually accessed via =SPC o A s= and allows quick searching of all task files.

I like to include archived tasks in the search.

#+BEGIN_SRC emacs-lisp
(after! org (setq org-agenda-text-search-extra-files '(agenda-archives)))
#+END_SRC

Also use the more intuitive boolean search method, where each word is searched independently rather than being treated
as a single phrase. A single phrase can be forced by enclosing in quotations.

#+BEGIN_SRC emacs-lisp
(after! org (setq org-agenda-search-view-always-boolean t))
#+END_SRC

*** Notes
I use org-roam, deft, and org-journal to manage my notes.

