config.html

<div id="outline-container-org655b4e7" class="outline-6">
<h6 id="org655b4e7"><span class="section-number-6">5.2.2.6.3</span> Agenda Support Functions</h6>
<div class="outline-text-6" id="text-5-2-2-6-3">
<p>
I have a few support functions for the agendas.
</p>

<p>
This is a custom <code>tags-todo</code> view which only shows the first TODO in a subheading, aka project.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">jsravn--tags-todo</span> <span style="color: #c678dd;">(</span>tags header<span style="color: #c678dd;">)</span>
  <span style="color: #83898d;">"Customized tags-todo view which only shows the first </span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #83898d;"> in a subheading."</span>
  <span style="color: #51afef;">`</span><span style="color: #c678dd;">(</span>tags-todo ,tags <span style="color: #98be65;">(</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">org-agenda-files</span> <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"~/Dropbox/Notes/todo.org"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
                     <span style="color: #51afef;">(</span><span style="color: #dcaeea;">org-agenda-overriding-header</span> ,header<span style="color: #51afef;">)</span>
                     <span style="color: #51afef;">(</span><span style="color: #dcaeea;">org-agenda-skip-function</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">jsravn--skip-all-siblings-but-first</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">jsravn--skip-all-siblings-but-first</span> <span style="color: #c678dd;">()</span>
  <span style="color: #83898d;">"Skip all but the first non-done entry that is inside a subheading."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">when</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">&gt;</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">car</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">org-heading-components</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">let</span> <span style="color: #51afef;">(</span>should-skip-entry<span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">save-excursion</span>
        <span style="color: #c678dd;">(</span><span style="color: #51afef;">while</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">and</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">not</span> should-skip-entry<span style="color: #51afef;">)</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">org-goto-sibling</span> t<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
          <span style="color: #98be65;">(</span><span style="color: #51afef;">when</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">string=</span> <span style="color: #98be65;">"</span><span style="color: #ECBE7B; font-weight: bold;">TODO</span><span style="color: #98be65;">"</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">org-get-todo-state</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
            <span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> should-skip-entry t<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
      <span style="color: #51afef;">(</span><span style="color: #51afef;">when</span> should-skip-entry
        <span style="color: #c678dd;">(</span><span style="color: #51afef;">or</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">outline-next-heading</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">point-max</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
This a custom filter that skips any <kbd>SCHEDULED</kbd> items which have already been filed in my <kbd>todo.org</kbd>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">jsravn--skip-scheduled-if-in-todo</span> <span style="color: #c678dd;">()</span>
  <span style="color: #83898d;">"Skip scheduled items that have been moved to todo.org."</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">when</span> <span style="color: #98be65;">(</span><span style="color: #51afef;">and</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">string=</span> <span style="color: #98be65;">"todo.org"</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">file-name-nondirectory</span> <span style="color: #98be65;">(</span><span style="color: #dcaeea;">buffer-file-name</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
             <span style="color: #51afef;">(</span><span style="color: #c678dd;">org-entry-get</span> nil <span style="color: #98be65;">"SCHEDULED"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">or</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">outline-next-heading</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">goto-char</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">point-max</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4f2de42" class="outline-5">
<h5 id="org4f2de42"><span class="section-number-5">5.2.2.7</span> Agenda Searches</h5>
<div class="outline-text-5" id="text-5-2-2-7">
<p>
Agenda search is usually accessed via <kbd>SPC o A s</kbd> and allows quick searching of all task files.
</p>

<p>
I like to include archived tasks in the search.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-agenda-text-search-extra-files</span> <span style="color: #51afef;">'</span><span style="color: #98be65;">(</span>agenda-archives<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Also use the more intuitive boolean search method, where each word is searched independently rather than being treated
as a single phrase. A single phrase can be forced by enclosing in quotations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org <span style="color: #c678dd;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-agenda-search-view-always-boolean</span> t<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc26d067" class="outline-4">
<h4 id="orgc26d067"><span class="section-number-4">5.2.3</span> Notes</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
I use org-roam, deft, and org-journal to manage my notes.
</p>
</div>
