config.org
**** org-roam
I use [[https://org-roam.readthedocs.io/en/master/][org-roam]] to organize my notes. =org-roam= is scoped to a single folder which contains all the org files that roam
should create metadata for. I prefer to keep my notes separate from my task system, so I put this into a dedicated
sub-folder inside the org directory.

#+BEGIN_SRC emacs-lisp
(setq org-roam-directory (concat org-directory "roam/"))
#+END_SRC

Change the default capture template. Specifically, place the title before the date so it's easy to locate the file
outside of orgmode such as on a mobile device.

#+BEGIN_SRC emacs-lisp
(setq org-roam-capture-templates
      '(("d" "default" plain (function org-roam-capture--get-point)
         "%?"
         :file-name "${slug}-%<%Y%m%d%H%M%S>"
         :head "#+TITLE: ${title}\n"
         :unnarrowed t)))
#+END_SRC

I'm also experimenting with deft as the interface for org-roam. I'm still undecided whether it is useful - I find myself
just using the normal =projectile-find-file= interface.

#+BEGIN_SRC emacs-lisp
(setq deft-directory org-roam-directory)
#+END_SRC

I don't want the org-roam buffer closing on =C-w C-o=.

#+BEGIN_SRC emacs-lisp
(setq org-roam-buffer-no-delete-other-windows t)
#+END_SRC

And I want the org-roam buffer to open automatically when I visit a roam file.

#+BEGIN_SRC emacs-lisp
(defun jsravn--open-org-roam ()
  "Called by `org-mode-hook' to call `org-roam' if the current buffer is a roam file."
  (remove-hook 'window-configuration-change-hook #'jsravn--open-org-roam)
  (when (org-roam--org-roam-file-p)
    (unless (eq 'visible (org-roam--current-visibility)) (org-roam))))

(after! org-roam
  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'window-configuration-change-hook #'jsravn--open-org-roam))))
#+END_SRC

**** org-journal
Set up org-journal to integrate with org-roam.

#+BEGIN_SRC emacs-lisp
(setq org-journal-date-prefix "#+TITLE: "
      org-journal-date-format "%A, %d %B %Y"
      org-journal-file-format "%Y-%m-%d.org"
      org-journal-dir org-roam-directory)
#+END_SRC
