config.html

<div id="outline-container-org65e90aa" class="outline-5">
<h5 id="org65e90aa"><span class="section-number-5">5.2.3.1</span> org-roam</h5>
<div class="outline-text-5" id="text-5-2-3-1">
<p>
I use <a href="https://org-roam.readthedocs.io/en/master/">org-roam</a> to organize my notes. <kbd>org-roam</kbd> is scoped to a single folder which contains all the org files that roam
should create metadata for. I prefer to keep my notes separate from my task system, so I put this into a dedicated
sub-folder inside the org directory.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-roam-directory</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">concat</span> <span style="color: #dcaeea;">org-directory</span> <span style="color: #98be65;">"roam/"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Change the default capture template. Specifically, place the title before the date so it&rsquo;s easy to locate the file
outside of orgmode such as on a mobile device.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-roam-capture-templates</span>
      <span style="color: #51afef;">'</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"d"</span> <span style="color: #98be65;">"default"</span> plain <span style="color: #51afef;">(</span><span style="color: #51afef;">function</span> org-roam-capture--get-point<span style="color: #51afef;">)</span>
         <span style="color: #98be65;">"%?"</span>
         <span style="color: #c678dd;">:file-name</span> <span style="color: #98be65;">"${slug}-%&lt;%Y%m%d%H%M%S&gt;"</span>
         <span style="color: #c678dd;">:head</span> <span style="color: #98be65;">"#+TITLE: ${title}\n"</span>
         <span style="color: #c678dd;">:unnarrowed</span> t<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
I&rsquo;m also experimenting with deft as the interface for org-roam. I&rsquo;m still undecided whether it is useful - I find myself
just using the normal <kbd>projectile-find-file</kbd> interface.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> deft-directory <span style="color: #dcaeea;">org-roam-directory</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
I don&rsquo;t want the org-roam buffer closing on <kbd>C-w C-o</kbd>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-roam-buffer-no-delete-other-windows</span> t<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And I want the org-roam buffer to open automatically when I visit a roam file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">jsravn--open-org-roam</span> <span style="color: #c678dd;">()</span>
  <span style="color: #83898d;">"Called by `</span><span style="color: #a9a1e1;">org-mode-hook</span><span style="color: #83898d;">' to call `</span><span style="color: #a9a1e1;">org-roam</span><span style="color: #83898d;">' if the current buffer is a roam file."</span>
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">remove-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">window-configuration-change-hook</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">jsravn--open-org-roam</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span><span style="color: #51afef;">when</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">org-roam--org-roam-file-p</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span><span style="color: #51afef;">unless</span> <span style="color: #51afef;">(</span><span style="color: #a9a1e1;">eq</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">visible</span> <span style="color: #c678dd;">(</span><span style="color: #c678dd;">org-roam--current-visibility</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">(</span><span style="color: #c678dd;">org-roam</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">after!</span> org-roam
  <span style="color: #c678dd;">(</span><span style="color: #c678dd;">add-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">org-mode-hook</span>
            <span style="color: #98be65;">(</span><span style="color: #51afef;">lambda</span> <span style="color: #51afef;">()</span>
              <span style="color: #51afef;">(</span><span style="color: #c678dd;">add-hook</span> <span style="color: #51afef;">'</span><span style="color: #dcaeea;">window-configuration-change-hook</span> <span style="color: #51afef;">#'</span><span style="color: #ECBE7B;">jsravn--open-org-roam</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org78ed253" class="outline-5">
<h5 id="org78ed253"><span class="section-number-5">5.2.3.2</span> org-journal</h5>
<div class="outline-text-5" id="text-5-2-3-2">
<p>
Set up org-journal to integrate with org-roam.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">org-journal-date-prefix</span> <span style="color: #98be65;">"#+TITLE: "</span>
      <span style="color: #dcaeea;">org-journal-date-format</span> <span style="color: #98be65;">"%A, %d %B %Y"</span>
      <span style="color: #dcaeea;">org-journal-file-format</span> <span style="color: #98be65;">"%Y-%m-%d.org"</span>
      <span style="color: #dcaeea;">org-journal-dir</span> <span style="color: #dcaeea;">org-roam-directory</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
