config.el

;; [[file:~/.config/doom/config.org::*org-roam][org-roam:1]]
(setq org-roam-directory (concat org-directory "roam/"))
;; org-roam:1 ends here

;; [[file:~/.config/doom/config.org::*org-roam][org-roam:2]]
(setq org-roam-capture-templates
      '(("d" "default" plain (function org-roam-capture--get-point)
         "%?"
         :file-name "${slug}-%<%Y%m%d%H%M%S>"
         :head "#+TITLE: ${title}\n"
         :unnarrowed t)))
;; org-roam:2 ends here

;; [[file:~/.config/doom/config.org::*org-roam][org-roam:3]]
(setq deft-directory org-roam-directory)
;; org-roam:3 ends here

;; [[file:~/.config/doom/config.org::*org-roam][org-roam:4]]
(setq org-roam-buffer-no-delete-other-windows t)
;; org-roam:4 ends here

;; [[file:~/.config/doom/config.org::*org-roam][org-roam:5]]
(defun jsravn--open-org-roam ()
  "Called by `org-mode-hook' to call `org-roam' if the current buffer is a roam file."
  (remove-hook 'window-configuration-change-hook #'jsravn--open-org-roam)
  (when (org-roam--org-roam-file-p)
    (unless (eq 'visible (org-roam--current-visibility)) (org-roam))))

(after! org-roam
  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'window-configuration-change-hook #'jsravn--open-org-roam))))
;; org-roam:5 ends here

;; [[file:~/.config/doom/config.org::*org-journal][org-journal:1]]
(setq org-journal-date-prefix "#+TITLE: "
      org-journal-date-format "%A, %d %B %Y"
      org-journal-file-format "%Y-%m-%d.org"
      org-journal-dir org-roam-directory)
;; org-journal:1 ends here
