config.html
<div id="outline-container-org12f5598" class="outline-4">
<h4 id="org12f5598"><span class="section-number-4">5.2.4</span> Calendar</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
I am experimenting with <kbd>org-caldav</kbd> to sync my org files with calendars. Much of this is taken from <a href="https://www.reddit.com/r/orgmode/comments/8rl8ep/making_orgcaldav_useable/">this reddit post</a>.
Unfortunately it&rsquo;s very slow and blocks Emacs completely while syncing. It also doesn&rsquo;t support recurring events.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(use-package! org-caldav</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">:after org</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">:init</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">;; Configure my calendars.</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(setq org-caldav-url "https://caldav.fastmail.com/dav/calendars/user/james@r-vn.org"</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">org-caldav-calendars</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">`((:calendar-id "0a220cb3-0ee8-49a9-af76-15c60bde70da"</span>
<span style="color: #5B6268;">;;            </span><span style="color: #5B6268;">:files ,(list (concat org-directory "cal-personal.org"))</span>
<span style="color: #5B6268;">;;            </span><span style="color: #5B6268;">:inbox ,(concat org-directory "cal-personal.org"))</span>
<span style="color: #5B6268;">;;           </span><span style="color: #5B6268;">(:calendar-id "071a3712-0213-4dac-a421-a79dc1760517"</span>
<span style="color: #5B6268;">;;            </span><span style="color: #5B6268;">:files ,(list (concat org-directory "cal-family.org"))</span>
<span style="color: #5B6268;">;;            </span><span style="color: #5B6268;">:inbox ,(concat org-directory "cal-family.org"))</span>
<span style="color: #5B6268;">;;           </span><span style="color: #5B6268;">(:calendar-id "4a92bcb6-a731-418c-89a3-97b86c0c51e5"</span>
<span style="color: #5B6268;">;;            </span><span style="color: #5B6268;">:files ,(list (concat org-directory "cal-holidayuk.org"))</span>
<span style="color: #5B6268;">;;            </span><span style="color: #5B6268;">:inbox ,(concat org-directory "cal-holidayuk.org"))))</span>

<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">;; Configure caldav.</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(let ((caldav-dir (concat org-directory ".org-caldav/")))</span>
<span style="color: #5B6268;">;;     </span><span style="color: #5B6268;">(setq org-caldav-backup-file (concat caldav-dir "org-caldav-backup.org")</span>
<span style="color: #5B6268;">;;           </span><span style="color: #5B6268;">org-caldav-save-directory caldav-dir</span>
<span style="color: #5B6268;">;;           </span><span style="color: #5B6268;">org-caldav-show-sync-results nil))</span>

<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">:config</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">;; Configure icalendar.</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(setq org-icalendar-alarm-time 1</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">org-icalendar-include-todo t</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">org-icalendar-timezone "Europe/London"</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">org-icalendar-use-deadline '(event-if-todo event-if-not-todo todo-due)</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">org-icalendar-use-scheduled '(todo-start event-if-todo event-if-not-todo))</span>

<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(map! :map org-mode-map</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">:localleader</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">:desc "Sync calendars" "C" #'org-caldav-sync))</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org7c09906" class="outline-4">
<h4 id="org7c09906"><span class="section-number-4">5.2.5</span> Alerts</h4>
<div class="outline-text-4" id="text-5-2-5">
<p>
Experiment using <kbd>org-alert</kbd> to get notified of impending deadlines. <span class="underline">Not working</span>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(use-package! org-alert</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">:after org</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">:init</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(setq alert-default-style 'libnotify                  ; Use system notifications.</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">org-alert-headline-regexp "\\(Deadline:.+\\)"   ; Only notify for deadlines.</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">org-alert-interval 7200)                        ; Check/alert bihourly.</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">:config</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(add-hook 'emacs-startup-hook #'org-alert-enable))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org828802c" class="outline-3">
<h3 id="org828802c"><span class="section-number-3">5.3</span> YAML</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Add Kubernetes schemas.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">setq</span> <span style="color: #dcaeea;">lsp-yaml-schemas</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">make-hash-table</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">puthash</span> <span style="color: #98be65;">"kubernetes"</span> <span style="color: #c678dd;">[</span><span style="color: #98be65;">"resources.yaml"</span>
                       <span style="color: #98be65;">"resources/*"</span>
                       <span style="color: #98be65;">"pod.yaml"</span>
                       <span style="color: #98be65;">"deployment.yaml"</span>
                       <span style="color: #98be65;">"serviceaccount.yaml"</span>
                       <span style="color: #98be65;">"clusterrole.yaml"</span>
                       <span style="color: #98be65;">"role.yaml"</span>
                       <span style="color: #98be65;">"clusterrolebinding.yaml"</span>
                       <span style="color: #98be65;">"rolebinding.yaml"</span>
                       <span style="color: #98be65;">"configmap.yaml"</span>
                       <span style="color: #98be65;">"service.yaml"</span><span style="color: #c678dd;">]</span>
         <span style="color: #dcaeea;">lsp-yaml-schemas</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">puthash</span> <span style="color: #98be65;">"http://json.schemastore.org/kustomization"</span> <span style="color: #c678dd;">[</span><span style="color: #98be65;">"kustomization.yaml"</span><span style="color: #c678dd;">]</span> <span style="color: #dcaeea;">lsp-yaml-schemas</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jsravn</p>
<p class="date">Created: 2020-05-21 Thu 10:08</p>
</div>
</body>
</html>
