config.el

;; [[file:~/.config/doom/config.org::*Calendar][Calendar:1]]
;; (use-package! org-caldav
;;   :after org
;;   :init
;;   ;; Configure my calendars.
;;   (setq org-caldav-url "https://caldav.fastmail.com/dav/calendars/user/james@r-vn.org"
;;         org-caldav-calendars
;;         `((:calendar-id "0a220cb3-0ee8-49a9-af76-15c60bde70da"
;;            :files ,(list (concat org-directory "cal-personal.org"))
;;            :inbox ,(concat org-directory "cal-personal.org"))
;;           (:calendar-id "071a3712-0213-4dac-a421-a79dc1760517"
;;            :files ,(list (concat org-directory "cal-family.org"))
;;            :inbox ,(concat org-directory "cal-family.org"))
;;           (:calendar-id "4a92bcb6-a731-418c-89a3-97b86c0c51e5"
;;            :files ,(list (concat org-directory "cal-holidayuk.org"))
;;            :inbox ,(concat org-directory "cal-holidayuk.org"))))

;;   ;; Configure caldav.
;;   (let ((caldav-dir (concat org-directory ".org-caldav/")))
;;     (setq org-caldav-backup-file (concat caldav-dir "org-caldav-backup.org")
;;           org-caldav-save-directory caldav-dir
;;           org-caldav-show-sync-results nil))

;;   :config
;;   ;; Configure icalendar.
;;   (setq org-icalendar-alarm-time 1
;;         org-icalendar-include-todo t
;;         org-icalendar-timezone "Europe/London"
;;         org-icalendar-use-deadline '(event-if-todo event-if-not-todo todo-due)
;;         org-icalendar-use-scheduled '(todo-start event-if-todo event-if-not-todo))

;;   (map! :map org-mode-map
;;         :localleader
;;         :desc "Sync calendars" "C" #'org-caldav-sync))
;; Calendar:1 ends here

;; [[file:~/.config/doom/config.org::*Alerts][Alerts:1]]
;; (use-package! org-alert
;;   :after org
;;   :init
;;   (setq alert-default-style 'libnotify                  ; Use system notifications.
;;         org-alert-headline-regexp "\\(Deadline:.+\\)"   ; Only notify for deadlines.
;;         org-alert-interval 7200)                        ; Check/alert bihourly.
;;   :config
;;   (add-hook 'emacs-startup-hook #'org-alert-enable))
;; Alerts:1 ends here

;; [[file:~/.config/doom/config.org::*YAML][YAML:1]]
(setq lsp-yaml-schemas (make-hash-table))
(puthash "kubernetes" ["resources.yaml"
                       "resources/*"
                       "pod.yaml"
                       "deployment.yaml"
                       "serviceaccount.yaml"
                       "clusterrole.yaml"
                       "role.yaml"
                       "clusterrolebinding.yaml"
                       "rolebinding.yaml"
                       "configmap.yaml"
                       "service.yaml"]
         lsp-yaml-schemas)
(puthash "http://json.schemastore.org/kustomization" ["kustomization.yaml"] lsp-yaml-schemas)
;; YAML:1 ends here
